una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3u2.h
// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR HDMA controller
// - *****************************************************************************
// - -------- HDMA_GCFG : (HDMA Offset: 0x0)  -------- 
AT91C_HDMA_ARB_CFG        EQU (0x1 <<  4) ;- (HDMA) Arbiter mode.
AT91C_HDMA_ARB_CFG_FIXED  EQU (0x0 <<  4) ;- (HDMA) Fixed priority arbiter.
AT91C_HDMA_ARB_CFG_ROUND_ROBIN EQU (0x1 <<  4) ;- (HDMA) Modified round robin arbiter.
// - -------- HDMA_EN : (HDMA Offset: 0x4)  -------- 
AT91C_HDMA_ENABLE         EQU (0x1 <<  0) ;- (HDMA) 
AT91C_HDMA_ENABLE_DISABLE EQU (0x0) ;- (HDMA) Disables HDMA.
AT91C_HDMA_ENABLE_ENABLE  EQU (0x1) ;- (HDMA) Enables HDMA.
// - -------- HDMA_SREQ : (HDMA Offset: 0x8)  -------- 
AT91C_HDMA_SSREQ0         EQU (0x1 <<  0) ;- (HDMA) Request a source single transfer on channel 0
AT91C_HDMA_SSREQ0_0       EQU (0x0) ;- (HDMA) No effect.
AT91C_HDMA_SSREQ0_1       EQU (0x1) ;- (HDMA) Request a source single transfer on channel 0.
AT91C_HDMA_DSREQ0         EQU (0x1 <<  1) ;- (HDMA) Request a destination single transfer on channel 0
AT91C_HDMA_DSREQ0_0       EQU (0x0 <<  1) ;- (HDMA) No effect.
AT91C_HDMA_DSREQ0_1       EQU (0x1 <<  1) ;- (HDMA) Request a destination single transfer on channel 0.
AT91C_HDMA_SSREQ1         EQU (0x1 <<  2) ;- (HDMA) Request a source single transfer on channel 1
AT91C_HDMA_SSREQ1_0       EQU (0x0 <<  2) ;- (HDMA) No effect.
AT91C_HDMA_SSREQ1_1       EQU (0x1 <<  2) ;- (HDMA) Request a source single transfer on channel 1.
AT91C_HDMA_DSREQ1         EQU (0x1 <<  3) ;- (HDMA) Request a destination single transfer on channel 1
AT91C_HDMA_DSREQ1_0       EQU (0x0 <<  3) ;- (HDMA) No effect.
AT91C_HDMA_DSREQ1_1       EQU (0x1 <<  3) ;- (HDMA) Request a destination single transfer on channel 1.
AT91C_HDMA_SSREQ2         EQU (0x1 <<  4) ;- (HDMA) Request a source single transfer on channel 2
AT91C_HDMA_SSREQ2_0       EQU (0x0 <<  4) ;- (HDMA) No effect.
AT91C_HDMA_SSREQ2_1       EQU (0x1 <<  4) ;- (HDMA) Request a source single transfer on channel 2.
AT91C_HDMA_DSREQ2         EQU (0x1 <<  5) ;- (HDMA) Request a destination single transfer on channel 2
AT91C_HDMA_DSREQ2_0       EQU (0x0 <<  5) ;- (HDMA) No effect.
AT91C_HDMA_DSREQ2_1       EQU (0x1 <<  5) ;- (HDMA) Request a destination single transfer on channel 2.
AT91C_HDMA_SSREQ3         EQU (0x1 <<  6) ;- (HDMA) Request a source single transfer on channel 3
AT91C_HDMA_SSREQ3_0       EQU (0x0 <<  6) ;- (HDMA) No effect.
AT91C_HDMA_SSREQ3_1       EQU (0x1 <<  6) ;- (HDMA) Request a source single transfer on channel 3.
AT91C_HDMA_DSREQ3         EQU (0x1 <<  7) ;- (HDMA) Request a destination single transfer on channel 3
AT91C_HDMA_DSREQ3_0       EQU (0x0 <<  7) ;- (HDMA) No effect.
AT91C_HDMA_DSREQ3_1       EQU (0x1 <<  7) ;- (HDMA) Request a destination single transfer on channel 3.
// - -------- HDMA_CREQ : (HDMA Offset: 0xc)  -------- 
AT91C_HDMA_SCREQ0         EQU (0x1 <<  0) ;- (HDMA) Request a source chunk transfer on channel 0
AT91C_HDMA_SCREQ0_0       EQU (0x0) ;- (HDMA) No effect.
AT91C_HDMA_SCREQ0_1       EQU (0x1) ;- (HDMA) Request a source chunk transfer on channel 0.
AT91C_HDMA_DCREQ0         EQU (0x1 <<  1) ;- (HDMA) Request a destination chunk transfer on channel 0
AT91C_HDMA_DCREQ0_0       EQU (0x0 <<  1) ;- (HDMA) No effect.
AT91C_HDMA_DCREQ0_1       EQU (0x1 <<  1) ;- (HDMA) Request a destination chunk transfer on channel 0.
AT91C_HDMA_SCREQ1         EQU (0x1 <<  2) ;- (HDMA) Request a source chunk transfer on channel 1
AT91C_HDMA_SCREQ1_0       EQU (0x0 <<  2) ;- (HDMA) No effect.
AT91C_HDMA_SCREQ1_1       EQU (0x1 <<  2) ;- (HDMA) Request a source chunk transfer on channel 1.
AT91C_HDMA_DCREQ1         EQU (0x1 <<  3) ;- (HDMA) Request a destination chunk transfer on channel 1
AT91C_HDMA_DCREQ1_0       EQU (0x0 <<  3) ;- (HDMA) No effect.
AT91C_HDMA_DCREQ1_1       EQU (0x1 <<  3) ;- (HDMA) Request a destination chunk transfer on channel 1.
AT91C_HDMA_SCREQ2         EQU (0x1 <<  4) ;- (HDMA) Request a source chunk transfer on channel 2
AT91C_HDMA_SCREQ2_0       EQU (0x0 <<  4) ;- (HDMA) No effect.
AT91C_HDMA_SCREQ2_1       EQU (0x1 <<  4) ;- (HDMA) Request a source chunk transfer on channel 2.
AT91C_HDMA_DCREQ2         EQU (0x1 <<  5) ;- (HDMA) Request a destination chunk transfer on channel 2
AT91C_HDMA_DCREQ2_0       EQU (0x0 <<  5) ;- (HDMA) No effect.
AT91C_HDMA_DCREQ2_1       EQU (0x1 <<  5) ;- (HDMA) Request a destination chunk transfer on channel 2.
AT91C_HDMA_SCREQ3         EQU (0x1 <<  6) ;- (HDMA) Request a source chunk transfer on channel 3
AT91C_HDMA_SCREQ3_0       EQU (0x0 <<  6) ;- (HDMA) No effect.
AT91C_HDMA_SCREQ3_1       EQU (0x1 <<  6) ;- (HDMA) Request a source chunk transfer on channel 3.
AT91C_HDMA_DCREQ3         EQU (0x1 <<  7) ;- (HDMA) Request a destination chunk transfer on channel 3
AT91C_HDMA_DCREQ3_0       EQU (0x0 <<  7) ;- (HDMA) No effect.
AT91C_HDMA_DCREQ3_1       EQU (0x1 <<  7) ;- (HDMA) Request a destination chunk transfer on channel 3.
// - -------- HDMA_LAST : (HDMA Offset: 0x10)  -------- 
AT91C_HDMA_SLAST0         EQU (0x1 <<  0) ;- (HDMA) Indicates that this source request is the last transfer of the buffer on channel 0
AT91C_HDMA_SLAST0_0       EQU (0x0) ;- (HDMA) No effect.
AT91C_HDMA_SLAST0_1       EQU (0x1) ;- (HDMA) Writing one to SLASTx prior to writing one to SSREQx or SCREQx indicates that this source request is the last transfer of the buffer on channel 0.
AT91C_HDMA_DLAST0         EQU (0x1 <<  1) ;- (HDMA) Indicates that this destination request is the last transfer of the buffer on channel 0
AT91C_HDMA_DLAST0_0       EQU (0x0 <<  1) ;- (HDMA) No effect.
AT91C_HDMA_DLAST0_1       EQU (0x1 <<  1) ;- (HDMA) Writing one to DLASTx prior to writing one to DSREQx or DCREQx indicates that this destination request is the last transfer of the buffer on channel 0.
AT91C_HDMA_SLAST1         EQU (0x1 <<  2) ;- (HDMA) Indicates that this source request is the last transfer of the buffer on channel 1
AT91C_HDMA_SLAST1_0       EQU (0x0 <<  2) ;- (HDMA) No effect.
AT91C_HDMA_SLAST1_1       EQU (0x1 <<  2) ;- (HDMA) Writing one to SLASTx prior to writing one to SSREQx or SCREQx indicates that this source request is the last transfer of the buffer on channel 1.
AT91C_HDMA_DLAST1         EQU (0x1 <<  3) ;- (HDMA) Indicates that this destination request is the last transfer of the buffer on channel 1
AT91C_HDMA_DLAST1_0       EQU (0x0 <<  3) ;- (HDMA) No effect.
AT91C_HDMA_DLAST1_1       EQU (0x1 <<  3) ;- (HDMA) Writing one to DLASTx prior to writing one to DSREQx or DCREQx indicates that this destination request is the last transfer of the buffer on channel 1.
AT91C_HDMA_SLAST2         EQU (0x1 <<  4) ;- (HDMA) Indicates that this source request is the last transfer of the buffer on channel 2
AT91C_HDMA_SLAST2_0       EQU (0x0 <<  4) ;- (HDMA) No effect.
AT91C_HDMA_SLAST2_1       EQU (0x1 <<  4) ;- (HDMA) Writing one to SLASTx prior to writing one to SSREQx or SCREQx indicates that this source request is the last transfer of the buffer on channel 2.
AT91C_HDMA_DLAST2         EQU (0x1 <<  5) ;- (HDMA) Indicates that this destination request is the last transfer of the buffer on channel 2
AT91C_HDMA_DLAST2_0       EQU (0x0 <<  5) ;- (HDMA) No effect.
AT91C_HDMA_DLAST2_1       EQU (0x1 <<  5) ;- (HDMA) Writing one to DLASTx prior to writing one to DSREQx or DCREQx indicates that this destination request is the last transfer of the buffer on channel 2.
AT91C_HDMA_SLAST3         EQU (0x1 <<  6) ;- (HDMA) Indicates that this source request is the last transfer of the buffer on channel 3
AT91C_HDMA_SLAST3_0       EQU (0x0 <<  6) ;- (HDMA) No effect.
AT91C_HDMA_SLAST3_1       EQU (0x1 <<  6) ;- (HDMA) Writing one to SLASTx prior to writing one to SSREQx or SCREQx indicates that this source request is the last transfer of the buffer on channel 3.
AT91C_HDMA_DLAST3         EQU (0x1 <<  7) ;- (HDMA) Indicates that this destination request is the last transfer of the buffer on channel 3
AT91C_HDMA_DLAST3_0       EQU (0x0 <<  7) ;- (HDMA) No effect.
AT91C_HDMA_DLAST3_1       EQU (0x1 <<  7) ;- (HDMA) Writing one to DLASTx prior to writing one to DSREQx or DCREQx indicates that this destination request is the last transfer of the buffer on channel 3.
// - -------- HDMA_EBCIER : (HDMA Offset: 0x18) Buffer Transfer Completed/Chained Buffer Transfer Completed/Access Error Interrupt Enable Register -------- 
AT91C_HDMA_BTC0           EQU (0x1 <<  0) ;- (HDMA) Buffer Transfer Completed Interrupt Enable/Disable/Status Register
AT91C_HDMA_BTC1           EQU (0x1 <<  1) ;- (HDMA) Buffer Transfer Completed Interrupt Enable/Disable/Status Register
AT91C_HDMA_BTC2           EQU (0x1 <<  2) ;- (HDMA) Buffer Transfer Completed Interrupt Enable/Disable/Status Register
AT91C_HDMA_BTC3           EQU (0x1 <<  3) ;- (HDMA) Buffer Transfer Completed Interrupt Enable/Disable/Status Register
AT91C_HDMA_BTC4           EQU (0x1 <<  4) ;- (HDMA) Buffer Transfer Completed Interrupt Enable/Disable/Status Register
AT91C_HDMA_BTC5           EQU (0x1 <<  5) ;- (HDMA) Buffer Transfer Completed Interrupt Enable/Disable/Status Register
AT91C_HDMA_BTC6           EQU (0x1 <<  6) ;- (HDMA) Buffer Transfer Completed Interrupt Enable/Disable/Status Register
AT91C_HDMA_BTC7           EQU (0x1 <<  7) ;- (HDMA) Buffer Transfer Completed Interrupt Enable/Disable/Status Register
AT91C_HDMA_CBTC0          EQU (0x1 <<  8) ;- (HDMA) Chained Buffer Transfer Completed Interrupt Enable/Disable/Status Register
AT91C_HDMA_CBTC1          EQU (0x1 <<  9) ;- (HDMA) Chained Buffer Transfer Completed Interrupt Enable/Disable/Status Register
AT91C_HDMA_CBTC2          EQU (0x1 << 10) ;- (HDMA) Chained Buffer Transfer Completed Interrupt Enable/Disable/Status Register
AT91C_HDMA_CBTC3          EQU (0x1 << 11) ;- (HDMA) Chained Buffer Transfer Completed Interrupt Enable/Disable/Status Register
AT91C_HDMA_CBTC4          EQU (0x1 << 12) ;- (HDMA) Chained Buffer Transfer Completed Interrupt Enable/Disable/Status Register
AT91C_HDMA_CBTC5          EQU (0x1 << 13) ;- (HDMA) Chained Buffer Transfer Completed Interrupt Enable/Disable/Status Register
AT91C_HDMA_CBTC6          EQU (0x1 << 14) ;- (HDMA) Chained Buffer Transfer Completed Interrupt Enable/Disable/Status Register
AT91C_HDMA_CBTC7          EQU (0x1 << 15) ;- (HDMA) Chained Buffer Transfer Completed Interrupt Enable/Disable/Status Register
AT91C_HDMA_ERR0           EQU (0x1 << 16) ;- (HDMA) Access HDMA_Error Interrupt Enable/Disable/Status Register
AT91C_HDMA_ERR1           EQU (0x1 << 17) ;- (HDMA) Access HDMA_Error Interrupt Enable/Disable/Status Register
AT91C_HDMA_ERR2           EQU (0x1 << 18) ;- (HDMA) Access HDMA_Error Interrupt Enable/Disable/Status Register
AT91C_HDMA_ERR3           EQU (0x1 << 19) ;- (HDMA) Access HDMA_Error Interrupt Enable/Disable/Status Register
AT91C_HDMA_ERR4           EQU (0x1 << 20) ;- (HDMA) Access HDMA_Error Interrupt Enable/Disable/Status Register
AT91C_HDMA_ERR5           EQU (0x1 << 21) ;- (HDMA) Access HDMA_Error Interrupt Enable/Disable/Status Register
AT91C_HDMA_ERR6           EQU (0x1 << 22) ;- (HDMA) Access HDMA_Error Interrupt Enable/Disable/Status Register
AT91C_HDMA_ERR7           EQU (0x1 << 23) ;- (HDMA) Access HDMA_Error Interrupt Enable/Disable/Status Register
// - -------- HDMA_EBCIDR : (HDMA Offset: 0x1c)  -------- 
// - -------- HDMA_EBCIMR : (HDMA Offset: 0x20)  -------- 
// - -------- HDMA_EBCISR : (HDMA Offset: 0x24)  -------- 
// - -------- HDMA_CHER : (HDMA Offset: 0x28)  -------- 
AT91C_HDMA_ENA0           EQU (0x1 <<  0) ;- (HDMA) When set, channel 0 enabled.
AT91C_HDMA_ENA0_0         EQU (0x0) ;- (HDMA) No effect.
AT91C_HDMA_ENA0_1         EQU (0x1) ;- (HDMA) Channel 0 enabled.
AT91C_HDMA_ENA1           EQU (0x1 <<  1) ;- (HDMA) When set, channel 1 enabled.
AT91C_HDMA_ENA1_0         EQU (0x0 <<  1) ;- (HDMA) No effect.
AT91C_HDMA_ENA1_1         EQU (0x1 <<  1) ;- (HDMA) Channel 1 enabled.
AT91C_HDMA_ENA2           EQU (0x1 <<  2) ;- (HDMA) When set, channel 2 enabled.
AT91C_HDMA_ENA2_0         EQU (0x0 <<  2) ;- (HDMA) No effect.
AT91C_HDMA_ENA2_1         EQU (0x1 <<  2) ;- (HDMA) Channel 2 enabled.
AT91C_HDMA_ENA3           EQU (0x1 <<  3) ;- (HDMA) When set, channel 3 enabled.
AT91C_HDMA_ENA3_0         EQU (0x0 <<  3) ;- (HDMA) No effect.
AT91C_HDMA_ENA3_1         EQU (0x1 <<  3) ;- (HDMA) Channel 3 enabled.
AT91C_HDMA_ENA4           EQU (0x1 <<  4) ;- (HDMA) When set, channel 4 enabled.
AT91C_HDMA_ENA4_0         EQU (0x0 <<  4) ;- (HDMA) No effect.
AT91C_HDMA_ENA4_1         EQU (0x1 <<  4) ;- (HDMA) Channel 4 enabled.
AT91C_HDMA_ENA5           EQU (0x1 <<  5) ;- (HDMA) When set, channel 5 enabled.
AT91C_HDMA_ENA5_0         EQU (0x0 <<  5) ;- (HDMA) No effect.
AT91C_HDMA_ENA5_1         EQU (0x1 <<  5) ;- (HDMA) Channel 5 enabled.
AT91C_HDMA_ENA6           EQU (0x1 <<  6) ;- (HDMA) When set, channel 6 enabled.
AT91C_HDMA_ENA6_0         EQU (0x0 <<  6) ;- (HDMA) No effect.
AT91C_HDMA_ENA6_1         EQU (0x1 <<  6) ;- (HDMA) Channel 6 enabled.
AT91C_HDMA_ENA7           EQU (0x1 <<  7) ;- (HDMA) When set, channel 7 enabled.
AT91C_HDMA_ENA7_0         EQU (0x0 <<  7) ;- (HDMA) No effect.
AT91C_HDMA_ENA7_1         EQU (0x1 <<  7) ;- (HDMA) Channel 7 enabled.
AT91C_HDMA_SUSP0          EQU (0x1 <<  8) ;- (HDMA) When set, channel 0 freezed and its current context.
AT91C_HDMA_SUSP0_0        EQU (0x0 <<  8) ;- (HDMA) No effect.
AT91C_HDMA_SUSP0_1        EQU (0x1 <<  8) ;- (HDMA) Channel 0 freezed.
AT91C_HDMA_SUSP1          EQU (0x1 <<  9) ;- (HDMA) When set, channel 1 freezed and its current context.
AT91C_HDMA_SUSP1_0        EQU (0x0 <<  9) ;- (HDMA) No effect.
AT91C_HDMA_SUSP1_1        EQU (0x1 <<  9) ;- (HDMA) Channel 1 freezed.
AT91C_HDMA_SUSP2          EQU (0x1 << 10) ;- (HDMA) When set, channel 2 freezed and its current context.
AT91C_HDMA_SUSP2_0        EQU (0x0 << 10) ;- (HDMA) No effect.
AT91C_HDMA_SUSP2_1        EQU (0x1 << 10) ;- (HDMA) Channel 2 freezed.
AT91C_HDMA_SUSP3          EQU (0x1 << 11) ;- (HDMA) When set, channel 3 freezed and its current context.
AT91C_HDMA_SUSP3_0        EQU (0x0 << 11) ;- (HDMA) No effect.
AT91C_HDMA_SUSP3_1        EQU (0x1 << 11) ;- (HDMA) Channel 3 freezed.
AT91C_HDMA_SUSP4          EQU (0x1 << 12) ;- (HDMA) When set, channel 4 freezed and its current context.
AT91C_HDMA_SUSP4_0        EQU (0x0 << 12) ;- (HDMA) No effect.
AT91C_HDMA_SUSP4_1        EQU (0x1 << 12) ;- (HDMA) Channel 4 freezed.
AT91C_HDMA_SUSP5          EQU (0x1 << 13) ;- (HDMA) When set, channel 5 freezed and its current context.
AT91C_HDMA_SUSP5_0        EQU (0x0 << 13) ;- (HDMA) No effect.
AT91C_HDMA_SUSP5_1        EQU (0x1 << 13) ;- (HDMA) Channel 5 freezed.
AT91C_HDMA_SUSP6          EQU (0x1 << 14) ;- (HDMA) When set, channel 6 freezed and its current context.
AT91C_HDMA_SUSP6_0        EQU (0x0 << 14) ;- (HDMA) No effect.
AT91C_HDMA_SUSP6_1        EQU (0x1 << 14) ;- (HDMA) Channel 6 freezed.
AT91C_HDMA_SUSP7          EQU (0x1 << 15) ;- (HDMA) When set, channel 7 freezed and its current context.
AT91C_HDMA_SUSP7_0        EQU (0x0 << 15) ;- (HDMA) No effect.
AT91C_HDMA_SUSP7_1        EQU (0x1 << 15) ;- (HDMA) Channel 7 freezed.
AT91C_HDMA_KEEP0          EQU (0x1 << 24) ;- (HDMA) When set, it resumes the channel 0 from an automatic stall state.
AT91C_HDMA_KEEP0_0        EQU (0x0 << 24) ;- (HDMA) No effect.
AT91C_HDMA_KEEP0_1        EQU (0x1 << 24) ;- (HDMA) Resumes the channel 0.
AT91C_HDMA_KEEP1          EQU (0x1 << 25) ;- (HDMA) When set, it resumes the channel 1 from an automatic stall state.
AT91C_HDMA_KEEP1_0        EQU (0x0 << 25) ;- (HDMA) No effect.
AT91C_HDMA_KEEP1_1        EQU (0x1 << 25) ;- (HDMA) Resumes the channel 1.
AT91C_HDMA_KEEP2          EQU (0x1 << 26) ;- (HDMA) When set, it resumes the channel 2 from an automatic stall state.
AT91C_HDMA_KEEP2_0        EQU (0x0 << 26) ;- (HDMA) No effect.
AT91C_HDMA_KEEP2_1        EQU (0x1 << 26) ;- (HDMA) Resumes the channel 2.
AT91C_HDMA_KEEP3          EQU (0x1 << 27) ;- (HDMA) When set, it resumes the channel 3 from an automatic stall state.
AT91C_HDMA_KEEP3_0        EQU (0x0 << 27) ;- (HDMA) No effect.
AT91C_HDMA_KEEP3_1        EQU (0x1 << 27) ;- (HDMA) Resumes the channel 3.
AT91C_HDMA_KEEP4          EQU (0x1 << 28) ;- (HDMA) When set, it resumes the channel 4 from an automatic stall state.
AT91C_HDMA_KEEP4_0        EQU (0x0 << 28) ;- (HDMA) No effect.
AT91C_HDMA_KEEP4_1        EQU (0x1 << 28) ;- (HDMA) Resumes the channel 4.
AT91C_HDMA_KEEP5          EQU (0x1 << 29) ;- (HDMA) When set, it resumes the channel 5 from an automatic stall state.
AT91C_HDMA_KEEP5_0        EQU (0x0 << 29) ;- (HDMA) No effect.
AT91C_HDMA_KEEP5_1        EQU (0x1 << 29) ;- (HDMA) Resumes the channel 5.
AT91C_HDMA_KEEP6          EQU (0x1 << 30) ;- (HDMA) When set, it resumes the channel 6 from an automatic stall state.
AT91C_HDMA_KEEP6_0        EQU (0x0 << 30) ;- (HDMA) No effect.
AT91C_HDMA_KEEP6_1        EQU (0x1 << 30) ;- (HDMA) Resumes the channel 6.
AT91C_HDMA_KEEP7          EQU (0x1 << 31) ;- (HDMA) When set, it resumes the channel 7 from an automatic stall state.
AT91C_HDMA_KEEP7_0        EQU (0x0 << 31) ;- (HDMA) No effect.
AT91C_HDMA_KEEP7_1        EQU (0x1 << 31) ;- (HDMA) Resumes the channel 7.
// - -------- HDMA_CHDR : (HDMA Offset: 0x2c)  -------- 
AT91C_HDMA_DIS0           EQU (0x1 <<  0) ;- (HDMA) Write one to this field to disable the channel 0.
AT91C_HDMA_DIS0_0         EQU (0x0) ;- (HDMA) No effect.
AT91C_HDMA_DIS0_1         EQU (0x1) ;- (HDMA) Disables the channel 0.
AT91C_HDMA_DIS1           EQU (0x1 <<  1) ;- (HDMA) Write one to this field to disable the channel 1.
AT91C_HDMA_DIS1_0         EQU (0x0 <<  1) ;- (HDMA) No effect.
AT91C_HDMA_DIS1_1         EQU (0x1 <<  1) ;- (HDMA) Disables the channel 1.
AT91C_HDMA_DIS2           EQU (0x1 <<  2) ;- (HDMA) Write one to this field to disable the channel 2.
AT91C_HDMA_DIS2_0         EQU (0x0 <<  2) ;- (HDMA) No effect.
AT91C_HDMA_DIS2_1         EQU (0x1 <<  2) ;- (HDMA) Disables the channel 2.
AT91C_HDMA_DIS3           EQU (0x1 <<  3) ;- (HDMA) Write one to this field to disable the channel 3.
AT91C_HDMA_DIS3_0         EQU (0x0 <<  3) ;- (HDMA) No effect.
AT91C_HDMA_DIS3_1         EQU (0x1 <<  3) ;- (HDMA) Disables the channel 3.
AT91C_HDMA_DIS4           EQU (0x1 <<  4) ;- (HDMA) Write one to this field to disable the channel 4.
AT91C_HDMA_DIS4_0         EQU (0x0 <<  4) ;- (HDMA) No effect.
AT91C_HDMA_DIS4_1         EQU (0x1 <<  4) ;- (HDMA) Disables the channel 4.
AT91C_HDMA_DIS5           EQU (0x1 <<  5) ;- (HDMA) Write one to this field to disable the channel 5.
AT91C_HDMA_DIS5_0         EQU (0x0 <<  5) ;- (HDMA) No effect.
AT91C_HDMA_DIS5_1         EQU (0x1 <<  5) ;- (HDMA) Disables the channel 5.
AT91C_HDMA_DIS6           EQU (0x1 <<  6) ;- (HDMA) Write one to this field to disable the channel 6.
AT91C_HDMA_DIS6_0         EQU (0x0 <<  6) ;- (HDMA) No effect.
AT91C_HDMA_DIS6_1         EQU (0x1 <<  6) ;- (HDMA) Disables the channel 6.
AT91C_HDMA_DIS7           EQU (0x1 <<  7) ;- (HDMA) Write one to this field to disable the channel 7.
AT91C_HDMA_DIS7_0         EQU (0x0 <<  7) ;- (HDMA) No effect.
AT91C_HDMA_DIS7_1         EQU (0x1 <<  7) ;- (HDMA) Disables the channel 7.
AT91C_HDMA_RES0           EQU (0x1 <<  8) ;- (HDMA) Write one to this field to resume the channel 0 transfer restoring its context.
AT91C_HDMA_RES0_0         EQU (0x0 <<  8) ;- (HDMA) No effect.
AT91C_HDMA_RES0_1         EQU (0x1 <<  8) ;- (HDMA) Resumes the channel 0.
AT91C_HDMA_RES1           EQU (0x1 <<  9) ;- (HDMA) Write one to this field to resume the channel 1 transfer restoring its context.
AT91C_HDMA_RES1_0         EQU (0x0 <<  9) ;- (HDMA) No effect.
AT91C_HDMA_RES1_1         EQU (0x1 <<  9) ;- (HDMA) Resumes the channel 1.
AT91C_HDMA_RES2           EQU (0x1 << 10) ;- (HDMA) Write one to this field to resume the channel 2 transfer restoring its context.
AT91C_HDMA_RES2_0         EQU (0x0 << 10) ;- (HDMA) No effect.
AT91C_HDMA_RES2_1         EQU (0x1 << 10) ;- (HDMA) Resumes the channel 2.
AT91C_HDMA_RES3           EQU (0x1 << 11) ;- (HDMA) Write one to this field to resume the channel 3 transfer restoring its context.
AT91C_HDMA_RES3_0         EQU (0x0 << 11) ;- (HDMA) No effect.
AT91C_HDMA_RES3_1         EQU (0x1 << 11) ;- (HDMA) Resumes the channel 3.
AT91C_HDMA_RES4           EQU (0x1 << 12) ;- (HDMA) Write one to this field to resume the channel 4 transfer restoring its context.
AT91C_HDMA_RES4_0         EQU (0x0 << 12) ;- (HDMA) No effect.
AT91C_HDMA_RES4_1         EQU (0x1 << 12) ;- (HDMA) Resumes the channel 4.
AT91C_HDMA_RES5           EQU (0x1 << 13) ;- (HDMA) Write one to this field to resume the channel 5 transfer restoring its context.
AT91C_HDMA_RES5_0         EQU (0x0 << 13) ;- (HDMA) No effect.
AT91C_HDMA_RES5_1         EQU (0x1 << 13) ;- (HDMA) Resumes the channel 5.
AT91C_HDMA_RES6           EQU (0x1 << 14) ;- (HDMA) Write one to this field to resume the channel 6 transfer restoring its context.
AT91C_HDMA_RES6_0         EQU (0x0 << 14) ;- (HDMA) No effect.
AT91C_HDMA_RES6_1         EQU (0x1 << 14) ;- (HDMA) Resumes the channel 6.
AT91C_HDMA_RES7           EQU (0x1 << 15) ;- (HDMA) Write one to this field to resume the channel 7 transfer restoring its context.
AT91C_HDMA_RES7_0         EQU (0x0 << 15) ;- (HDMA) No effect.
AT91C_HDMA_RES7_1         EQU (0x1 << 15) ;- (HDMA) Resumes the channel 7.
// - -------- HDMA_CHSR : (HDMA Offset: 0x30)  -------- 
AT91C_HDMA_EMPT0          EQU (0x1 << 16) ;- (HDMA) When set, channel 0 is empty.
AT91C_HDMA_EMPT0_0        EQU (0x0 << 16) ;- (HDMA) No effect.
AT91C_HDMA_EMPT0_1        EQU (0x1 << 16) ;- (HDMA) Channel 0 empty.
AT91C_HDMA_EMPT1          EQU (0x1 << 17) ;- (HDMA) When set, channel 1 is empty.
AT91C_HDMA_EMPT1_0        EQU (0x0 << 17) ;- (HDMA) No effect.
AT91C_HDMA_EMPT1_1        EQU (0x1 << 17) ;- (HDMA) Channel 1 empty.
AT91C_HDMA_EMPT2          EQU (0x1 << 18) ;- (HDMA) When set, channel 2 is empty.
AT91C_HDMA_EMPT2_0        EQU (0x0 << 18) ;- (HDMA) No effect.
AT91C_HDMA_EMPT2_1        EQU (0x1 << 18) ;- (HDMA) Channel 2 empty.
AT91C_HDMA_EMPT3          EQU (0x1 << 19) ;- (HDMA) When set, channel 3 is empty.
AT91C_HDMA_EMPT3_0        EQU (0x0 << 19) ;- (HDMA) No effect.
AT91C_HDMA_EMPT3_1        EQU (0x1 << 19) ;- (HDMA) Channel 3 empty.
AT91C_HDMA_EMPT4          EQU (0x1 << 20) ;- (HDMA) When set, channel 4 is empty.
AT91C_HDMA_EMPT4_0        EQU (0x0 << 20) ;- (HDMA) No effect.
AT91C_HDMA_EMPT4_1        EQU (0x1 << 20) ;- (HDMA) Channel 4 empty.
AT91C_HDMA_EMPT5          EQU (0x1 << 21) ;- (HDMA) When set, channel 5 is empty.
AT91C_HDMA_EMPT5_0        EQU (0x0 << 21) ;- (HDMA) No effect.
AT91C_HDMA_EMPT5_1        EQU (0x1 << 21) ;- (HDMA) Channel 5 empty.
AT91C_HDMA_EMPT6          EQU (0x1 << 22) ;- (HDMA) When set, channel 6 is empty.
AT91C_HDMA_EMPT6_0        EQU (0x0 << 22) ;- (HDMA) No effect.
AT91C_HDMA_EMPT6_1        EQU (0x1 << 22) ;- (HDMA) Channel 6 empty.
AT91C_HDMA_EMPT7          EQU (0x1 << 23) ;- (HDMA) When set, channel 7 is empty.
AT91C_HDMA_EMPT7_0        EQU (0x0 << 23) ;- (HDMA) No effect.
AT91C_HDMA_EMPT7_1        EQU (0x1 << 23) ;- (HDMA) Channel 7 empty.
AT91C_HDMA_STAL0          EQU (0x1 << 24) ;- (HDMA) When set, channel 0 is stalled.
AT91C_HDMA_STAL0_0        EQU (0x0 << 24) ;- (HDMA) No effect.
AT91C_HDMA_STAL0_1        EQU (0x1 << 24) ;- (HDMA) Channel 0 stalled.
AT91C_HDMA_STAL1          EQU (0x1 << 25) ;- (HDMA) When set, channel 1 is stalled.
AT91C_HDMA_STAL1_0        EQU (0x0 << 25) ;- (HDMA) No effect.
AT91C_HDMA_STAL1_1        EQU (0x1 << 25) ;- (HDMA) Channel 1 stalled.
AT91C_HDMA_STAL2          EQU (0x1 << 26) ;- (HDMA) When set, channel 2 is stalled.
AT91C_HDMA_STAL2_0        EQU (0x0 << 26) ;- (HDMA) No effect.
