una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3u2.h
AT91C_TWI1_RNCR           EQU (0x40088114) ;- (PDC_TWI1) Receive Next Counter Register
AT91C_TWI1_RCR            EQU (0x40088104) ;- (PDC_TWI1) Receive Counter Register
AT91C_TWI1_RPR            EQU (0x40088100) ;- (PDC_TWI1) Receive Pointer Register
AT91C_TWI1_TNPR           EQU (0x40088118) ;- (PDC_TWI1) Transmit Next Pointer Register
AT91C_TWI1_RNPR           EQU (0x40088110) ;- (PDC_TWI1) Receive Next Pointer Register
AT91C_TWI1_TCR            EQU (0x4008810C) ;- (PDC_TWI1) Transmit Counter Register
AT91C_TWI1_TPR            EQU (0x40088108) ;- (PDC_TWI1) Transmit Pointer Register
AT91C_TWI1_PTSR           EQU (0x40088124) ;- (PDC_TWI1) PDC Transfer Status Register
// - ========== Register definition for TWI0 peripheral ========== 
AT91C_TWI0_FEATURES       EQU (0x400840F8) ;- (TWI0) TWI FEATURES REGISTER 
AT91C_TWI0_IPNAME1        EQU (0x400840F0) ;- (TWI0) TWI IPNAME1 REGISTER 
AT91C_TWI0_SMR            EQU (0x40084008) ;- (TWI0) Slave Mode Register
AT91C_TWI0_MMR            EQU (0x40084004) ;- (TWI0) Master Mode Register
AT91C_TWI0_SR             EQU (0x40084020) ;- (TWI0) Status Register
AT91C_TWI0_IPNAME2        EQU (0x400840F4) ;- (TWI0) TWI IPNAME2 REGISTER 
AT91C_TWI0_CR             EQU (0x40084000) ;- (TWI0) Control Register
AT91C_TWI0_IER            EQU (0x40084024) ;- (TWI0) Interrupt Enable Register
AT91C_TWI0_RHR            EQU (0x40084030) ;- (TWI0) Receive Holding Register
AT91C_TWI0_ADDRSIZE       EQU (0x400840EC) ;- (TWI0) TWI ADDRSIZE REGISTER 
AT91C_TWI0_THR            EQU (0x40084034) ;- (TWI0) Transmit Holding Register
AT91C_TWI0_VER            EQU (0x400840FC) ;- (TWI0) Version Register
AT91C_TWI0_IADR           EQU (0x4008400C) ;- (TWI0) Internal Address Register
AT91C_TWI0_IMR            EQU (0x4008402C) ;- (TWI0) Interrupt Mask Register
AT91C_TWI0_CWGR           EQU (0x40084010) ;- (TWI0) Clock Waveform Generator Register
AT91C_TWI0_IDR            EQU (0x40084028) ;- (TWI0) Interrupt Disable Register
// - ========== Register definition for TWI1 peripheral ========== 
AT91C_TWI1_VER            EQU (0x400880FC) ;- (TWI1) Version Register
AT91C_TWI1_IDR            EQU (0x40088028) ;- (TWI1) Interrupt Disable Register
AT91C_TWI1_IPNAME2        EQU (0x400880F4) ;- (TWI1) TWI IPNAME2 REGISTER 
AT91C_TWI1_CWGR           EQU (0x40088010) ;- (TWI1) Clock Waveform Generator Register
AT91C_TWI1_CR             EQU (0x40088000) ;- (TWI1) Control Register
AT91C_TWI1_ADDRSIZE       EQU (0x400880EC) ;- (TWI1) TWI ADDRSIZE REGISTER 
AT91C_TWI1_IADR           EQU (0x4008800C) ;- (TWI1) Internal Address Register
AT91C_TWI1_IER            EQU (0x40088024) ;- (TWI1) Interrupt Enable Register
AT91C_TWI1_SMR            EQU (0x40088008) ;- (TWI1) Slave Mode Register
AT91C_TWI1_RHR            EQU (0x40088030) ;- (TWI1) Receive Holding Register
AT91C_TWI1_FEATURES       EQU (0x400880F8) ;- (TWI1) TWI FEATURES REGISTER 
AT91C_TWI1_IMR            EQU (0x4008802C) ;- (TWI1) Interrupt Mask Register
AT91C_TWI1_SR             EQU (0x40088020) ;- (TWI1) Status Register
AT91C_TWI1_THR            EQU (0x40088034) ;- (TWI1) Transmit Holding Register
AT91C_TWI1_MMR            EQU (0x40088004) ;- (TWI1) Master Mode Register
AT91C_TWI1_IPNAME1        EQU (0x400880F0) ;- (TWI1) TWI IPNAME1 REGISTER 
// - ========== Register definition for PDC_US0 peripheral ========== 
AT91C_US0_RNCR            EQU (0x40090114) ;- (PDC_US0) Receive Next Counter Register
AT91C_US0_TNPR            EQU (0x40090118) ;- (PDC_US0) Transmit Next Pointer Register
AT91C_US0_TPR             EQU (0x40090108) ;- (PDC_US0) Transmit Pointer Register
AT91C_US0_RCR             EQU (0x40090104) ;- (PDC_US0) Receive Counter Register
AT91C_US0_RNPR            EQU (0x40090110) ;- (PDC_US0) Receive Next Pointer Register
AT91C_US0_TNCR            EQU (0x4009011C) ;- (PDC_US0) Transmit Next Counter Register
AT91C_US0_PTSR            EQU (0x40090124) ;- (PDC_US0) PDC Transfer Status Register
AT91C_US0_RPR             EQU (0x40090100) ;- (PDC_US0) Receive Pointer Register
AT91C_US0_PTCR            EQU (0x40090120) ;- (PDC_US0) PDC Transfer Control Register
AT91C_US0_TCR             EQU (0x4009010C) ;- (PDC_US0) Transmit Counter Register
// - ========== Register definition for US0 peripheral ========== 
AT91C_US0_NER             EQU (0x40090044) ;- (US0) Nb Errors Register
AT91C_US0_RHR             EQU (0x40090018) ;- (US0) Receiver Holding Register
AT91C_US0_IPNAME1         EQU (0x400900F0) ;- (US0) US IPNAME1 REGISTER 
AT91C_US0_MR              EQU (0x40090004) ;- (US0) Mode Register
AT91C_US0_RTOR            EQU (0x40090024) ;- (US0) Receiver Time-out Register
AT91C_US0_IF              EQU (0x4009004C) ;- (US0) IRDA_FILTER Register
AT91C_US0_ADDRSIZE        EQU (0x400900EC) ;- (US0) US ADDRSIZE REGISTER 
AT91C_US0_IDR             EQU (0x4009000C) ;- (US0) Interrupt Disable Register
AT91C_US0_IMR             EQU (0x40090010) ;- (US0) Interrupt Mask Register
AT91C_US0_IER             EQU (0x40090008) ;- (US0) Interrupt Enable Register
AT91C_US0_TTGR            EQU (0x40090028) ;- (US0) Transmitter Time-guard Register
AT91C_US0_IPNAME2         EQU (0x400900F4) ;- (US0) US IPNAME2 REGISTER 
AT91C_US0_FIDI            EQU (0x40090040) ;- (US0) FI_DI_Ratio Register
AT91C_US0_CR              EQU (0x40090000) ;- (US0) Control Register
AT91C_US0_BRGR            EQU (0x40090020) ;- (US0) Baud Rate Generator Register
AT91C_US0_MAN             EQU (0x40090050) ;- (US0) Manchester Encoder Decoder Register
AT91C_US0_VER             EQU (0x400900FC) ;- (US0) VERSION Register
AT91C_US0_FEATURES        EQU (0x400900F8) ;- (US0) US FEATURES REGISTER 
AT91C_US0_CSR             EQU (0x40090014) ;- (US0) Channel Status Register
AT91C_US0_THR             EQU (0x4009001C) ;- (US0) Transmitter Holding Register
// - ========== Register definition for PDC_US1 peripheral ========== 
AT91C_US1_TNPR            EQU (0x40094118) ;- (PDC_US1) Transmit Next Pointer Register
AT91C_US1_TPR             EQU (0x40094108) ;- (PDC_US1) Transmit Pointer Register
AT91C_US1_RNCR            EQU (0x40094114) ;- (PDC_US1) Receive Next Counter Register
AT91C_US1_TNCR            EQU (0x4009411C) ;- (PDC_US1) Transmit Next Counter Register
AT91C_US1_RNPR            EQU (0x40094110) ;- (PDC_US1) Receive Next Pointer Register
AT91C_US1_TCR             EQU (0x4009410C) ;- (PDC_US1) Transmit Counter Register
AT91C_US1_PTSR            EQU (0x40094124) ;- (PDC_US1) PDC Transfer Status Register
AT91C_US1_RCR             EQU (0x40094104) ;- (PDC_US1) Receive Counter Register
AT91C_US1_RPR             EQU (0x40094100) ;- (PDC_US1) Receive Pointer Register
AT91C_US1_PTCR            EQU (0x40094120) ;- (PDC_US1) PDC Transfer Control Register
// - ========== Register definition for US1 peripheral ========== 
AT91C_US1_IMR             EQU (0x40094010) ;- (US1) Interrupt Mask Register
AT91C_US1_RTOR            EQU (0x40094024) ;- (US1) Receiver Time-out Register
AT91C_US1_RHR             EQU (0x40094018) ;- (US1) Receiver Holding Register
AT91C_US1_IPNAME1         EQU (0x400940F0) ;- (US1) US IPNAME1 REGISTER 
AT91C_US1_VER             EQU (0x400940FC) ;- (US1) VERSION Register
AT91C_US1_MR              EQU (0x40094004) ;- (US1) Mode Register
AT91C_US1_FEATURES        EQU (0x400940F8) ;- (US1) US FEATURES REGISTER 
AT91C_US1_NER             EQU (0x40094044) ;- (US1) Nb Errors Register
AT91C_US1_IPNAME2         EQU (0x400940F4) ;- (US1) US IPNAME2 REGISTER 
AT91C_US1_CR              EQU (0x40094000) ;- (US1) Control Register
AT91C_US1_BRGR            EQU (0x40094020) ;- (US1) Baud Rate Generator Register
AT91C_US1_IF              EQU (0x4009404C) ;- (US1) IRDA_FILTER Register
AT91C_US1_IER             EQU (0x40094008) ;- (US1) Interrupt Enable Register
AT91C_US1_TTGR            EQU (0x40094028) ;- (US1) Transmitter Time-guard Register
AT91C_US1_FIDI            EQU (0x40094040) ;- (US1) FI_DI_Ratio Register
AT91C_US1_MAN             EQU (0x40094050) ;- (US1) Manchester Encoder Decoder Register
AT91C_US1_ADDRSIZE        EQU (0x400940EC) ;- (US1) US ADDRSIZE REGISTER 
AT91C_US1_CSR             EQU (0x40094014) ;- (US1) Channel Status Register
AT91C_US1_THR             EQU (0x4009401C) ;- (US1) Transmitter Holding Register
AT91C_US1_IDR             EQU (0x4009400C) ;- (US1) Interrupt Disable Register
// - ========== Register definition for PDC_US2 peripheral ========== 
AT91C_US2_RPR             EQU (0x40098100) ;- (PDC_US2) Receive Pointer Register
AT91C_US2_TPR             EQU (0x40098108) ;- (PDC_US2) Transmit Pointer Register
AT91C_US2_TCR             EQU (0x4009810C) ;- (PDC_US2) Transmit Counter Register
AT91C_US2_PTSR            EQU (0x40098124) ;- (PDC_US2) PDC Transfer Status Register
AT91C_US2_PTCR            EQU (0x40098120) ;- (PDC_US2) PDC Transfer Control Register
AT91C_US2_RNPR            EQU (0x40098110) ;- (PDC_US2) Receive Next Pointer Register
AT91C_US2_TNCR            EQU (0x4009811C) ;- (PDC_US2) Transmit Next Counter Register
AT91C_US2_RNCR            EQU (0x40098114) ;- (PDC_US2) Receive Next Counter Register
AT91C_US2_TNPR            EQU (0x40098118) ;- (PDC_US2) Transmit Next Pointer Register
AT91C_US2_RCR             EQU (0x40098104) ;- (PDC_US2) Receive Counter Register
// - ========== Register definition for US2 peripheral ========== 
AT91C_US2_MAN             EQU (0x40098050) ;- (US2) Manchester Encoder Decoder Register
AT91C_US2_ADDRSIZE        EQU (0x400980EC) ;- (US2) US ADDRSIZE REGISTER 
AT91C_US2_MR              EQU (0x40098004) ;- (US2) Mode Register
AT91C_US2_IPNAME1         EQU (0x400980F0) ;- (US2) US IPNAME1 REGISTER 
AT91C_US2_IF              EQU (0x4009804C) ;- (US2) IRDA_FILTER Register
AT91C_US2_BRGR            EQU (0x40098020) ;- (US2) Baud Rate Generator Register
AT91C_US2_FIDI            EQU (0x40098040) ;- (US2) FI_DI_Ratio Register
AT91C_US2_IER             EQU (0x40098008) ;- (US2) Interrupt Enable Register
AT91C_US2_RTOR            EQU (0x40098024) ;- (US2) Receiver Time-out Register
AT91C_US2_CR              EQU (0x40098000) ;- (US2) Control Register
AT91C_US2_THR             EQU (0x4009801C) ;- (US2) Transmitter Holding Register
AT91C_US2_CSR             EQU (0x40098014) ;- (US2) Channel Status Register
AT91C_US2_VER             EQU (0x400980FC) ;- (US2) VERSION Register
AT91C_US2_FEATURES        EQU (0x400980F8) ;- (US2) US FEATURES REGISTER 
AT91C_US2_IDR             EQU (0x4009800C) ;- (US2) Interrupt Disable Register
AT91C_US2_TTGR            EQU (0x40098028) ;- (US2) Transmitter Time-guard Register
AT91C_US2_IPNAME2         EQU (0x400980F4) ;- (US2) US IPNAME2 REGISTER 
AT91C_US2_RHR             EQU (0x40098018) ;- (US2) Receiver Holding Register
AT91C_US2_NER             EQU (0x40098044) ;- (US2) Nb Errors Register
AT91C_US2_IMR             EQU (0x40098010) ;- (US2) Interrupt Mask Register
// - ========== Register definition for PDC_US3 peripheral ========== 
AT91C_US3_TPR             EQU (0x4009C108) ;- (PDC_US3) Transmit Pointer Register
AT91C_US3_PTCR            EQU (0x4009C120) ;- (PDC_US3) PDC Transfer Control Register
AT91C_US3_TCR             EQU (0x4009C10C) ;- (PDC_US3) Transmit Counter Register
AT91C_US3_RCR             EQU (0x4009C104) ;- (PDC_US3) Receive Counter Register
AT91C_US3_RNCR            EQU (0x4009C114) ;- (PDC_US3) Receive Next Counter Register
AT91C_US3_RNPR            EQU (0x4009C110) ;- (PDC_US3) Receive Next Pointer Register
AT91C_US3_RPR             EQU (0x4009C100) ;- (PDC_US3) Receive Pointer Register
AT91C_US3_PTSR            EQU (0x4009C124) ;- (PDC_US3) PDC Transfer Status Register
AT91C_US3_TNCR            EQU (0x4009C11C) ;- (PDC_US3) Transmit Next Counter Register
AT91C_US3_TNPR            EQU (0x4009C118) ;- (PDC_US3) Transmit Next Pointer Register
// - ========== Register definition for US3 peripheral ========== 
AT91C_US3_MAN             EQU (0x4009C050) ;- (US3) Manchester Encoder Decoder Register
AT91C_US3_CSR             EQU (0x4009C014) ;- (US3) Channel Status Register
AT91C_US3_BRGR            EQU (0x4009C020) ;- (US3) Baud Rate Generator Register
AT91C_US3_IPNAME2         EQU (0x4009C0F4) ;- (US3) US IPNAME2 REGISTER 
AT91C_US3_RTOR            EQU (0x4009C024) ;- (US3) Receiver Time-out Register
AT91C_US3_ADDRSIZE        EQU (0x4009C0EC) ;- (US3) US ADDRSIZE REGISTER 
AT91C_US3_CR              EQU (0x4009C000) ;- (US3) Control Register
AT91C_US3_IF              EQU (0x4009C04C) ;- (US3) IRDA_FILTER Register
AT91C_US3_FEATURES        EQU (0x4009C0F8) ;- (US3) US FEATURES REGISTER 
AT91C_US3_VER             EQU (0x4009C0FC) ;- (US3) VERSION Register
AT91C_US3_RHR             EQU (0x4009C018) ;- (US3) Receiver Holding Register
AT91C_US3_TTGR            EQU (0x4009C028) ;- (US3) Transmitter Time-guard Register
AT91C_US3_NER             EQU (0x4009C044) ;- (US3) Nb Errors Register
AT91C_US3_IMR             EQU (0x4009C010) ;- (US3) Interrupt Mask Register
AT91C_US3_THR             EQU (0x4009C01C) ;- (US3) Transmitter Holding Register
AT91C_US3_IDR             EQU (0x4009C00C) ;- (US3) Interrupt Disable Register
AT91C_US3_MR              EQU (0x4009C004) ;- (US3) Mode Register
AT91C_US3_IER             EQU (0x4009C008) ;- (US3) Interrupt Enable Register
AT91C_US3_FIDI            EQU (0x4009C040) ;- (US3) FI_DI_Ratio Register
AT91C_US3_IPNAME1         EQU (0x4009C0F0) ;- (US3) US IPNAME1 REGISTER 
// - ========== Register definition for PDC_SSC0 peripheral ========== 
AT91C_SSC0_RNCR           EQU (0x40004114) ;- (PDC_SSC0) Receive Next Counter Register
AT91C_SSC0_TPR            EQU (0x40004108) ;- (PDC_SSC0) Transmit Pointer Register
AT91C_SSC0_TCR            EQU (0x4000410C) ;- (PDC_SSC0) Transmit Counter Register
AT91C_SSC0_PTCR           EQU (0x40004120) ;- (PDC_SSC0) PDC Transfer Control Register
AT91C_SSC0_TNPR           EQU (0x40004118) ;- (PDC_SSC0) Transmit Next Pointer Register
AT91C_SSC0_RPR            EQU (0x40004100) ;- (PDC_SSC0) Receive Pointer Register
AT91C_SSC0_TNCR           EQU (0x4000411C) ;- (PDC_SSC0) Transmit Next Counter Register
AT91C_SSC0_RNPR           EQU (0x40004110) ;- (PDC_SSC0) Receive Next Pointer Register
AT91C_SSC0_RCR            EQU (0x40004104) ;- (PDC_SSC0) Receive Counter Register
AT91C_SSC0_PTSR           EQU (0x40004124) ;- (PDC_SSC0) PDC Transfer Status Register
// - ========== Register definition for SSC0 peripheral ========== 
AT91C_SSC0_CR             EQU (0x40004000) ;- (SSC0) Control Register
AT91C_SSC0_RHR            EQU (0x40004020) ;- (SSC0) Receive Holding Register
AT91C_SSC0_TSHR           EQU (0x40004034) ;- (SSC0) Transmit Sync Holding Register
AT91C_SSC0_RFMR           EQU (0x40004014) ;- (SSC0) Receive Frame Mode Register
AT91C_SSC0_IDR            EQU (0x40004048) ;- (SSC0) Interrupt Disable Register
AT91C_SSC0_TFMR           EQU (0x4000401C) ;- (SSC0) Transmit Frame Mode Register
AT91C_SSC0_RSHR           EQU (0x40004030) ;- (SSC0) Receive Sync Holding Register
AT91C_SSC0_RC1R           EQU (0x4000403C) ;- (SSC0) Receive Compare 1 Register
AT91C_SSC0_TCMR           EQU (0x40004018) ;- (SSC0) Transmit Clock Mode Register
AT91C_SSC0_RCMR           EQU (0x40004010) ;- (SSC0) Receive Clock ModeRegister
AT91C_SSC0_SR             EQU (0x40004040) ;- (SSC0) Status Register
AT91C_SSC0_RC0R           EQU (0x40004038) ;- (SSC0) Receive Compare 0 Register
AT91C_SSC0_THR            EQU (0x40004024) ;- (SSC0) Transmit Holding Register
AT91C_SSC0_CMR            EQU (0x40004004) ;- (SSC0) Clock Mode Register
AT91C_SSC0_IER            EQU (0x40004044) ;- (SSC0) Interrupt Enable Register
AT91C_SSC0_IMR            EQU (0x4000404C) ;- (SSC0) Interrupt Mask Register
// - ========== Register definition for PDC_PWMC peripheral ========== 
AT91C_PWMC_TNCR           EQU (0x4008C11C) ;- (PDC_PWMC) Transmit Next Counter Register
AT91C_PWMC_TPR            EQU (0x4008C108) ;- (PDC_PWMC) Transmit Pointer Register
AT91C_PWMC_RPR            EQU (0x4008C100) ;- (PDC_PWMC) Receive Pointer Register
AT91C_PWMC_TCR            EQU (0x4008C10C) ;- (PDC_PWMC) Transmit Counter Register
AT91C_PWMC_PTSR           EQU (0x4008C124) ;- (PDC_PWMC) PDC Transfer Status Register
AT91C_PWMC_RNPR           EQU (0x4008C110) ;- (PDC_PWMC) Receive Next Pointer Register
AT91C_PWMC_RCR            EQU (0x4008C104) ;- (PDC_PWMC) Receive Counter Register
AT91C_PWMC_RNCR           EQU (0x4008C114) ;- (PDC_PWMC) Receive Next Counter Register
AT91C_PWMC_PTCR           EQU (0x4008C120) ;- (PDC_PWMC) PDC Transfer Control Register
AT91C_PWMC_TNPR           EQU (0x4008C118) ;- (PDC_PWMC) Transmit Next Pointer Register
// - ========== Register definition for PWMC_CH0 peripheral ========== 
AT91C_PWMC_CH0_DTR        EQU (0x4008C218) ;- (PWMC_CH0) Channel Dead Time Value Register
AT91C_PWMC_CH0_CMR        EQU (0x4008C200) ;- (PWMC_CH0) Channel Mode Register
AT91C_PWMC_CH0_CCNTR      EQU (0x4008C214) ;- (PWMC_CH0) Channel Counter Register
AT91C_PWMC_CH0_CPRDR      EQU (0x4008C20C) ;- (PWMC_CH0) Channel Period Register
AT91C_PWMC_CH0_DTUPDR     EQU (0x4008C21C) ;- (PWMC_CH0) Channel Dead Time Update Value Register
AT91C_PWMC_CH0_CPRDUPDR   EQU (0x4008C210) ;- (PWMC_CH0) Channel Period Update Register
AT91C_PWMC_CH0_CDTYUPDR   EQU (0x4008C208) ;- (PWMC_CH0) Channel Duty Cycle Update Register
AT91C_PWMC_CH0_CDTYR      EQU (0x4008C204) ;- (PWMC_CH0) Channel Duty Cycle Register
// - ========== Register definition for PWMC_CH1 peripheral ========== 
AT91C_PWMC_CH1_CCNTR      EQU (0x4008C234) ;- (PWMC_CH1) Channel Counter Register
AT91C_PWMC_CH1_DTR        EQU (0x4008C238) ;- (PWMC_CH1) Channel Dead Time Value Register
AT91C_PWMC_CH1_CDTYUPDR   EQU (0x4008C228) ;- (PWMC_CH1) Channel Duty Cycle Update Register
AT91C_PWMC_CH1_DTUPDR     EQU (0x4008C23C) ;- (PWMC_CH1) Channel Dead Time Update Value Register
AT91C_PWMC_CH1_CDTYR      EQU (0x4008C224) ;- (PWMC_CH1) Channel Duty Cycle Register
AT91C_PWMC_CH1_CPRDR      EQU (0x4008C22C) ;- (PWMC_CH1) Channel Period Register
AT91C_PWMC_CH1_CPRDUPDR   EQU (0x4008C230) ;- (PWMC_CH1) Channel Period Update Register
AT91C_PWMC_CH1_CMR        EQU (0x4008C220) ;- (PWMC_CH1) Channel Mode Register
// - ========== Register definition for PWMC_CH2 peripheral ========== 
AT91C_PWMC_CH2_CDTYR      EQU (0x4008C244) ;- (PWMC_CH2) Channel Duty Cycle Register
AT91C_PWMC_CH2_DTUPDR     EQU (0x4008C25C) ;- (PWMC_CH2) Channel Dead Time Update Value Register
AT91C_PWMC_CH2_CCNTR      EQU (0x4008C254) ;- (PWMC_CH2) Channel Counter Register
AT91C_PWMC_CH2_CMR        EQU (0x4008C240) ;- (PWMC_CH2) Channel Mode Register
AT91C_PWMC_CH2_CPRDR      EQU (0x4008C24C) ;- (PWMC_CH2) Channel Period Register
AT91C_PWMC_CH2_CPRDUPDR   EQU (0x4008C250) ;- (PWMC_CH2) Channel Period Update Register
AT91C_PWMC_CH2_CDTYUPDR   EQU (0x4008C248) ;- (PWMC_CH2) Channel Duty Cycle Update Register
AT91C_PWMC_CH2_DTR        EQU (0x4008C258) ;- (PWMC_CH2) Channel Dead Time Value Register
// - ========== Register definition for PWMC_CH3 peripheral ========== 
AT91C_PWMC_CH3_CPRDUPDR   EQU (0x4008C270) ;- (PWMC_CH3) Channel Period Update Register
AT91C_PWMC_CH3_DTR        EQU (0x4008C278) ;- (PWMC_CH3) Channel Dead Time Value Register
AT91C_PWMC_CH3_CDTYR      EQU (0x4008C264) ;- (PWMC_CH3) Channel Duty Cycle Register
AT91C_PWMC_CH3_DTUPDR     EQU (0x4008C27C) ;- (PWMC_CH3) Channel Dead Time Update Value Register
AT91C_PWMC_CH3_CDTYUPDR   EQU (0x4008C268) ;- (PWMC_CH3) Channel Duty Cycle Update Register
AT91C_PWMC_CH3_CCNTR      EQU (0x4008C274) ;- (PWMC_CH3) Channel Counter Register
AT91C_PWMC_CH3_CMR        EQU (0x4008C260) ;- (PWMC_CH3) Channel Mode Register
AT91C_PWMC_CH3_CPRDR      EQU (0x4008C26C) ;- (PWMC_CH3) Channel Period Register
// - ========== Register definition for PWMC peripheral ========== 
AT91C_PWMC_CMP6MUPD       EQU (0x4008C19C) ;- (PWMC) PWM Comparison Mode 6 Update Register
AT91C_PWMC_ISR1           EQU (0x4008C01C) ;- (PWMC) PWMC Interrupt Status Register 1
AT91C_PWMC_CMP5V          EQU (0x4008C180) ;- (PWMC) PWM Comparison Value 5 Register
AT91C_PWMC_CMP4MUPD       EQU (0x4008C17C) ;- (PWMC) PWM Comparison Mode 4 Update Register
AT91C_PWMC_FMR            EQU (0x4008C05C) ;- (PWMC) PWM Fault Mode Register
AT91C_PWMC_CMP6V          EQU (0x4008C190) ;- (PWMC) PWM Comparison Value 6 Register
AT91C_PWMC_EL4MR          EQU (0x4008C08C) ;- (PWMC) PWM Event Line 4 Mode Register
AT91C_PWMC_UPCR           EQU (0x4008C028) ;- (PWMC) PWM Update Control Register
AT91C_PWMC_CMP1VUPD       EQU (0x4008C144) ;- (PWMC) PWM Comparison Value 1 Update Register
AT91C_PWMC_CMP0M          EQU (0x4008C138) ;- (PWMC) PWM Comparison Mode 0 Register
AT91C_PWMC_CMP5VUPD       EQU (0x4008C184) ;- (PWMC) PWM Comparison Value 5 Update Register
AT91C_PWMC_FPER3          EQU (0x4008C074) ;- (PWMC) PWM Fault Protection Enable Register 3
AT91C_PWMC_OSCUPD         EQU (0x4008C058) ;- (PWMC) PWM Output Selection Clear Update Register
AT91C_PWMC_FPER1          EQU (0x4008C06C) ;- (PWMC) PWM Fault Protection Enable Register 1
AT91C_PWMC_SCUPUPD        EQU (0x4008C030) ;- (PWMC) PWM Update Period Update Register
AT91C_PWMC_DIS            EQU (0x4008C008) ;- (PWMC) PWMC Disable Register
AT91C_PWMC_IER1           EQU (0x4008C010) ;- (PWMC) PWMC Interrupt Enable Register 1
AT91C_PWMC_IMR2           EQU (0x4008C03C) ;- (PWMC) PWMC Interrupt Mask Register 2
AT91C_PWMC_CMP0V          EQU (0x4008C130) ;- (PWMC) PWM Comparison Value 0 Register
AT91C_PWMC_SR             EQU (0x4008C00C) ;- (PWMC) PWMC Status Register
AT91C_PWMC_CMP4M          EQU (0x4008C178) ;- (PWMC) PWM Comparison Mode 4 Register
AT91C_PWMC_CMP3M          EQU (0x4008C168) ;- (PWMC) PWM Comparison Mode 3 Register
AT91C_PWMC_IER2           EQU (0x4008C034) ;- (PWMC) PWMC Interrupt Enable Register 2
AT91C_PWMC_CMP3VUPD       EQU (0x4008C164) ;- (PWMC) PWM Comparison Value 3 Update Register
AT91C_PWMC_CMP2M          EQU (0x4008C158) ;- (PWMC) PWM Comparison Mode 2 Register
AT91C_PWMC_IDR2           EQU (0x4008C038) ;- (PWMC) PWMC Interrupt Disable Register 2
AT91C_PWMC_EL2MR          EQU (0x4008C084) ;- (PWMC) PWM Event Line 2 Mode Register
AT91C_PWMC_CMP7V          EQU (0x4008C1A0) ;- (PWMC) PWM Comparison Value 7 Register
AT91C_PWMC_CMP1M          EQU (0x4008C148) ;- (PWMC) PWM Comparison Mode 1 Register
AT91C_PWMC_CMP0VUPD       EQU (0x4008C134) ;- (PWMC) PWM Comparison Value 0 Update Register
AT91C_PWMC_WPSR           EQU (0x4008C0E8) ;- (PWMC) PWM Write Protection Status Register
AT91C_PWMC_CMP6VUPD       EQU (0x4008C194) ;- (PWMC) PWM Comparison Value 6 Update Register
AT91C_PWMC_CMP1MUPD       EQU (0x4008C14C) ;- (PWMC) PWM Comparison Mode 1 Update Register
AT91C_PWMC_CMP1V          EQU (0x4008C140) ;- (PWMC) PWM Comparison Value 1 Register
AT91C_PWMC_FCR            EQU (0x4008C064) ;- (PWMC) PWM Fault Mode Clear Register
AT91C_PWMC_VER            EQU (0x4008C0FC) ;- (PWMC) PWMC Version Register
AT91C_PWMC_EL1MR          EQU (0x4008C080) ;- (PWMC) PWM Event Line 1 Mode Register
AT91C_PWMC_EL6MR          EQU (0x4008C094) ;- (PWMC) PWM Event Line 6 Mode Register
AT91C_PWMC_ISR2           EQU (0x4008C040) ;- (PWMC) PWMC Interrupt Status Register 2
AT91C_PWMC_CMP4VUPD       EQU (0x4008C174) ;- (PWMC) PWM Comparison Value 4 Update Register
AT91C_PWMC_CMP5MUPD       EQU (0x4008C18C) ;- (PWMC) PWM Comparison Mode 5 Update Register
AT91C_PWMC_OS             EQU (0x4008C048) ;- (PWMC) PWM Output Selection Register
AT91C_PWMC_FPV            EQU (0x4008C068) ;- (PWMC) PWM Fault Protection Value Register
AT91C_PWMC_FPER2          EQU (0x4008C070) ;- (PWMC) PWM Fault Protection Enable Register 2
AT91C_PWMC_EL7MR          EQU (0x4008C098) ;- (PWMC) PWM Event Line 7 Mode Register
AT91C_PWMC_OSSUPD         EQU (0x4008C054) ;- (PWMC) PWM Output Selection Set Update Register
AT91C_PWMC_FEATURES       EQU (0x4008C0F8) ;- (PWMC) PWMC FEATURES REGISTER 
AT91C_PWMC_CMP2V          EQU (0x4008C150) ;- (PWMC) PWM Comparison Value 2 Register
