una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3u2.h
AT91C_PWMC_FSR            EQU (0x4008C060) ;- (PWMC) PWM Fault Mode Status Register
AT91C_PWMC_ADDRSIZE       EQU (0x4008C0EC) ;- (PWMC) PWMC ADDRSIZE REGISTER 
AT91C_PWMC_OSC            EQU (0x4008C050) ;- (PWMC) PWM Output Selection Clear Register
AT91C_PWMC_SCUP           EQU (0x4008C02C) ;- (PWMC) PWM Update Period Register
AT91C_PWMC_CMP7MUPD       EQU (0x4008C1AC) ;- (PWMC) PWM Comparison Mode 7 Update Register
AT91C_PWMC_CMP2VUPD       EQU (0x4008C154) ;- (PWMC) PWM Comparison Value 2 Update Register
AT91C_PWMC_FPER4          EQU (0x4008C078) ;- (PWMC) PWM Fault Protection Enable Register 4
AT91C_PWMC_IMR1           EQU (0x4008C018) ;- (PWMC) PWMC Interrupt Mask Register 1
AT91C_PWMC_EL3MR          EQU (0x4008C088) ;- (PWMC) PWM Event Line 3 Mode Register
AT91C_PWMC_CMP3V          EQU (0x4008C160) ;- (PWMC) PWM Comparison Value 3 Register
AT91C_PWMC_IPNAME1        EQU (0x4008C0F0) ;- (PWMC) PWMC IPNAME1 REGISTER 
AT91C_PWMC_OSS            EQU (0x4008C04C) ;- (PWMC) PWM Output Selection Set Register
AT91C_PWMC_CMP0MUPD       EQU (0x4008C13C) ;- (PWMC) PWM Comparison Mode 0 Update Register
AT91C_PWMC_CMP2MUPD       EQU (0x4008C15C) ;- (PWMC) PWM Comparison Mode 2 Update Register
AT91C_PWMC_CMP4V          EQU (0x4008C170) ;- (PWMC) PWM Comparison Value 4 Register
AT91C_PWMC_ENA            EQU (0x4008C004) ;- (PWMC) PWMC Enable Register
AT91C_PWMC_CMP3MUPD       EQU (0x4008C16C) ;- (PWMC) PWM Comparison Mode 3 Update Register
AT91C_PWMC_EL0MR          EQU (0x4008C07C) ;- (PWMC) PWM Event Line 0 Mode Register
AT91C_PWMC_OOV            EQU (0x4008C044) ;- (PWMC) PWM Output Override Value Register
AT91C_PWMC_WPCR           EQU (0x4008C0E4) ;- (PWMC) PWM Write Protection Enable Register
AT91C_PWMC_CMP7M          EQU (0x4008C1A8) ;- (PWMC) PWM Comparison Mode 7 Register
AT91C_PWMC_CMP6M          EQU (0x4008C198) ;- (PWMC) PWM Comparison Mode 6 Register
AT91C_PWMC_CMP5M          EQU (0x4008C188) ;- (PWMC) PWM Comparison Mode 5 Register
AT91C_PWMC_IPNAME2        EQU (0x4008C0F4) ;- (PWMC) PWMC IPNAME2 REGISTER 
AT91C_PWMC_CMP7VUPD       EQU (0x4008C1A4) ;- (PWMC) PWM Comparison Value 7 Update Register
AT91C_PWMC_SYNC           EQU (0x4008C020) ;- (PWMC) PWM Synchronized Channels Register
AT91C_PWMC_MR             EQU (0x4008C000) ;- (PWMC) PWMC Mode Register
AT91C_PWMC_IDR1           EQU (0x4008C014) ;- (PWMC) PWMC Interrupt Disable Register 1
AT91C_PWMC_EL5MR          EQU (0x4008C090) ;- (PWMC) PWM Event Line 5 Mode Register
// - ========== Register definition for SPI0 peripheral ========== 
AT91C_SPI0_ADDRSIZE       EQU (0x400080EC) ;- (SPI0) SPI ADDRSIZE REGISTER 
AT91C_SPI0_RDR            EQU (0x40008008) ;- (SPI0) Receive Data Register
AT91C_SPI0_FEATURES       EQU (0x400080F8) ;- (SPI0) SPI FEATURES REGISTER 
AT91C_SPI0_CR             EQU (0x40008000) ;- (SPI0) Control Register
AT91C_SPI0_IPNAME1        EQU (0x400080F0) ;- (SPI0) SPI IPNAME1 REGISTER 
AT91C_SPI0_VER            EQU (0x400080FC) ;- (SPI0) Version Register
AT91C_SPI0_IDR            EQU (0x40008018) ;- (SPI0) Interrupt Disable Register
AT91C_SPI0_TDR            EQU (0x4000800C) ;- (SPI0) Transmit Data Register
AT91C_SPI0_MR             EQU (0x40008004) ;- (SPI0) Mode Register
AT91C_SPI0_IER            EQU (0x40008014) ;- (SPI0) Interrupt Enable Register
AT91C_SPI0_IMR            EQU (0x4000801C) ;- (SPI0) Interrupt Mask Register
AT91C_SPI0_IPNAME2        EQU (0x400080F4) ;- (SPI0) SPI IPNAME2 REGISTER 
AT91C_SPI0_CSR            EQU (0x40008030) ;- (SPI0) Chip Select Register
AT91C_SPI0_SR             EQU (0x40008010) ;- (SPI0) Status Register
// - ========== Register definition for UDPHS_EPTFIFO peripheral ========== 
AT91C_UDPHS_EPTFIFO_READEPT6 EQU (0x201E0000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 6
AT91C_UDPHS_EPTFIFO_READEPT2 EQU (0x201A0000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 2
AT91C_UDPHS_EPTFIFO_READEPT1 EQU (0x20190000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 1
AT91C_UDPHS_EPTFIFO_READEPT0 EQU (0x20180000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 0
AT91C_UDPHS_EPTFIFO_READEPT5 EQU (0x201D0000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 5
AT91C_UDPHS_EPTFIFO_READEPT4 EQU (0x201C0000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 4
AT91C_UDPHS_EPTFIFO_READEPT3 EQU (0x201B0000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 3
// - ========== Register definition for UDPHS_EPT_0 peripheral ========== 
AT91C_UDPHS_EPT_0_EPTCTL  EQU (0x400A410C) ;- (UDPHS_EPT_0) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_0_EPTSTA  EQU (0x400A411C) ;- (UDPHS_EPT_0) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_0_EPTCLRSTA EQU (0x400A4118) ;- (UDPHS_EPT_0) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_0_EPTCTLDIS EQU (0x400A4108) ;- (UDPHS_EPT_0) UDPHS Endpoint Control Disable Register
AT91C_UDPHS_EPT_0_EPTCFG  EQU (0x400A4100) ;- (UDPHS_EPT_0) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_0_EPTSETSTA EQU (0x400A4114) ;- (UDPHS_EPT_0) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_0_EPTCTLENB EQU (0x400A4104) ;- (UDPHS_EPT_0) UDPHS Endpoint Control Enable Register
// - ========== Register definition for UDPHS_EPT_1 peripheral ========== 
AT91C_UDPHS_EPT_1_EPTSTA  EQU (0x400A413C) ;- (UDPHS_EPT_1) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_1_EPTSETSTA EQU (0x400A4134) ;- (UDPHS_EPT_1) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_1_EPTCTL  EQU (0x400A412C) ;- (UDPHS_EPT_1) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_1_EPTCFG  EQU (0x400A4120) ;- (UDPHS_EPT_1) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_1_EPTCTLDIS EQU (0x400A4128) ;- (UDPHS_EPT_1) UDPHS Endpoint Control Disable Register
AT91C_UDPHS_EPT_1_EPTCLRSTA EQU (0x400A4138) ;- (UDPHS_EPT_1) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_1_EPTCTLENB EQU (0x400A4124) ;- (UDPHS_EPT_1) UDPHS Endpoint Control Enable Register
// - ========== Register definition for UDPHS_EPT_2 peripheral ========== 
AT91C_UDPHS_EPT_2_EPTCTLENB EQU (0x400A4144) ;- (UDPHS_EPT_2) UDPHS Endpoint Control Enable Register
AT91C_UDPHS_EPT_2_EPTCLRSTA EQU (0x400A4158) ;- (UDPHS_EPT_2) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_2_EPTCFG  EQU (0x400A4140) ;- (UDPHS_EPT_2) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_2_EPTCTL  EQU (0x400A414C) ;- (UDPHS_EPT_2) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_2_EPTSETSTA EQU (0x400A4154) ;- (UDPHS_EPT_2) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_2_EPTSTA  EQU (0x400A415C) ;- (UDPHS_EPT_2) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_2_EPTCTLDIS EQU (0x400A4148) ;- (UDPHS_EPT_2) UDPHS Endpoint Control Disable Register
// - ========== Register definition for UDPHS_EPT_3 peripheral ========== 
AT91C_UDPHS_EPT_3_EPTCTLDIS EQU (0x400A4168) ;- (UDPHS_EPT_3) UDPHS Endpoint Control Disable Register
AT91C_UDPHS_EPT_3_EPTCTLENB EQU (0x400A4164) ;- (UDPHS_EPT_3) UDPHS Endpoint Control Enable Register
AT91C_UDPHS_EPT_3_EPTSETSTA EQU (0x400A4174) ;- (UDPHS_EPT_3) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_3_EPTCLRSTA EQU (0x400A4178) ;- (UDPHS_EPT_3) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_3_EPTCFG  EQU (0x400A4160) ;- (UDPHS_EPT_3) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_3_EPTSTA  EQU (0x400A417C) ;- (UDPHS_EPT_3) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_3_EPTCTL  EQU (0x400A416C) ;- (UDPHS_EPT_3) UDPHS Endpoint Control Register
// - ========== Register definition for UDPHS_EPT_4 peripheral ========== 
AT91C_UDPHS_EPT_4_EPTSETSTA EQU (0x400A4194) ;- (UDPHS_EPT_4) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_4_EPTCTLDIS EQU (0x400A4188) ;- (UDPHS_EPT_4) UDPHS Endpoint Control Disable Register
AT91C_UDPHS_EPT_4_EPTCTL  EQU (0x400A418C) ;- (UDPHS_EPT_4) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_4_EPTCFG  EQU (0x400A4180) ;- (UDPHS_EPT_4) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_4_EPTCTLENB EQU (0x400A4184) ;- (UDPHS_EPT_4) UDPHS Endpoint Control Enable Register
AT91C_UDPHS_EPT_4_EPTSTA  EQU (0x400A419C) ;- (UDPHS_EPT_4) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_4_EPTCLRSTA EQU (0x400A4198) ;- (UDPHS_EPT_4) UDPHS Endpoint Clear Status Register
// - ========== Register definition for UDPHS_EPT_5 peripheral ========== 
AT91C_UDPHS_EPT_5_EPTCFG  EQU (0x400A41A0) ;- (UDPHS_EPT_5) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_5_EPTCTL  EQU (0x400A41AC) ;- (UDPHS_EPT_5) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_5_EPTCTLENB EQU (0x400A41A4) ;- (UDPHS_EPT_5) UDPHS Endpoint Control Enable Register
AT91C_UDPHS_EPT_5_EPTSTA  EQU (0x400A41BC) ;- (UDPHS_EPT_5) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_5_EPTSETSTA EQU (0x400A41B4) ;- (UDPHS_EPT_5) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_5_EPTCTLDIS EQU (0x400A41A8) ;- (UDPHS_EPT_5) UDPHS Endpoint Control Disable Register
AT91C_UDPHS_EPT_5_EPTCLRSTA EQU (0x400A41B8) ;- (UDPHS_EPT_5) UDPHS Endpoint Clear Status Register
// - ========== Register definition for UDPHS_EPT_6 peripheral ========== 
AT91C_UDPHS_EPT_6_EPTCLRSTA EQU (0x400A41D8) ;- (UDPHS_EPT_6) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_6_EPTCTL  EQU (0x400A41CC) ;- (UDPHS_EPT_6) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_6_EPTCFG  EQU (0x400A41C0) ;- (UDPHS_EPT_6) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_6_EPTCTLDIS EQU (0x400A41C8) ;- (UDPHS_EPT_6) UDPHS Endpoint Control Disable Register
AT91C_UDPHS_EPT_6_EPTSTA  EQU (0x400A41DC) ;- (UDPHS_EPT_6) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_6_EPTCTLENB EQU (0x400A41C4) ;- (UDPHS_EPT_6) UDPHS Endpoint Control Enable Register
AT91C_UDPHS_EPT_6_EPTSETSTA EQU (0x400A41D4) ;- (UDPHS_EPT_6) UDPHS Endpoint Set Status Register
// - ========== Register definition for UDPHS_DMA_1 peripheral ========== 
AT91C_UDPHS_DMA_1_DMASTATUS EQU (0x400A431C) ;- (UDPHS_DMA_1) UDPHS DMA Channel Status Register
AT91C_UDPHS_DMA_1_DMACONTROL EQU (0x400A4318) ;- (UDPHS_DMA_1) UDPHS DMA Channel Control Register
AT91C_UDPHS_DMA_1_DMANXTDSC EQU (0x400A4310) ;- (UDPHS_DMA_1) UDPHS DMA Channel Next Descriptor Address
AT91C_UDPHS_DMA_1_DMAADDRESS EQU (0x400A4314) ;- (UDPHS_DMA_1) UDPHS DMA Channel Address Register
// - ========== Register definition for UDPHS_DMA_2 peripheral ========== 
AT91C_UDPHS_DMA_2_DMASTATUS EQU (0x400A432C) ;- (UDPHS_DMA_2) UDPHS DMA Channel Status Register
AT91C_UDPHS_DMA_2_DMANXTDSC EQU (0x400A4320) ;- (UDPHS_DMA_2) UDPHS DMA Channel Next Descriptor Address
AT91C_UDPHS_DMA_2_DMACONTROL EQU (0x400A4328) ;- (UDPHS_DMA_2) UDPHS DMA Channel Control Register
AT91C_UDPHS_DMA_2_DMAADDRESS EQU (0x400A4324) ;- (UDPHS_DMA_2) UDPHS DMA Channel Address Register
// - ========== Register definition for UDPHS_DMA_3 peripheral ========== 
AT91C_UDPHS_DMA_3_DMACONTROL EQU (0x400A4338) ;- (UDPHS_DMA_3) UDPHS DMA Channel Control Register
AT91C_UDPHS_DMA_3_DMANXTDSC EQU (0x400A4330) ;- (UDPHS_DMA_3) UDPHS DMA Channel Next Descriptor Address
AT91C_UDPHS_DMA_3_DMASTATUS EQU (0x400A433C) ;- (UDPHS_DMA_3) UDPHS DMA Channel Status Register
AT91C_UDPHS_DMA_3_DMAADDRESS EQU (0x400A4334) ;- (UDPHS_DMA_3) UDPHS DMA Channel Address Register
// - ========== Register definition for UDPHS_DMA_4 peripheral ========== 
AT91C_UDPHS_DMA_4_DMAADDRESS EQU (0x400A4344) ;- (UDPHS_DMA_4) UDPHS DMA Channel Address Register
AT91C_UDPHS_DMA_4_DMANXTDSC EQU (0x400A4340) ;- (UDPHS_DMA_4) UDPHS DMA Channel Next Descriptor Address
AT91C_UDPHS_DMA_4_DMASTATUS EQU (0x400A434C) ;- (UDPHS_DMA_4) UDPHS DMA Channel Status Register
AT91C_UDPHS_DMA_4_DMACONTROL EQU (0x400A4348) ;- (UDPHS_DMA_4) UDPHS DMA Channel Control Register
// - ========== Register definition for UDPHS_DMA_5 peripheral ========== 
AT91C_UDPHS_DMA_5_DMACONTROL EQU (0x400A4358) ;- (UDPHS_DMA_5) UDPHS DMA Channel Control Register
AT91C_UDPHS_DMA_5_DMAADDRESS EQU (0x400A4354) ;- (UDPHS_DMA_5) UDPHS DMA Channel Address Register
AT91C_UDPHS_DMA_5_DMANXTDSC EQU (0x400A4350) ;- (UDPHS_DMA_5) UDPHS DMA Channel Next Descriptor Address
AT91C_UDPHS_DMA_5_DMASTATUS EQU (0x400A435C) ;- (UDPHS_DMA_5) UDPHS DMA Channel Status Register
// - ========== Register definition for UDPHS_DMA_6 peripheral ========== 
AT91C_UDPHS_DMA_6_DMASTATUS EQU (0x400A436C) ;- (UDPHS_DMA_6) UDPHS DMA Channel Status Register
AT91C_UDPHS_DMA_6_DMACONTROL EQU (0x400A4368) ;- (UDPHS_DMA_6) UDPHS DMA Channel Control Register
AT91C_UDPHS_DMA_6_DMANXTDSC EQU (0x400A4360) ;- (UDPHS_DMA_6) UDPHS DMA Channel Next Descriptor Address
AT91C_UDPHS_DMA_6_DMAADDRESS EQU (0x400A4364) ;- (UDPHS_DMA_6) UDPHS DMA Channel Address Register
// - ========== Register definition for UDPHS peripheral ========== 
AT91C_UDPHS_EPTRST        EQU (0x400A401C) ;- (UDPHS) UDPHS Endpoints Reset Register
AT91C_UDPHS_IEN           EQU (0x400A4010) ;- (UDPHS) UDPHS Interrupt Enable Register
AT91C_UDPHS_TSTCNTB       EQU (0x400A40D8) ;- (UDPHS) UDPHS Test B Counter Register
AT91C_UDPHS_RIPNAME2      EQU (0x400A40F4) ;- (UDPHS) UDPHS Name2 Register
AT91C_UDPHS_RIPPADDRSIZE  EQU (0x400A40EC) ;- (UDPHS) UDPHS PADDRSIZE Register
AT91C_UDPHS_TSTMODREG     EQU (0x400A40DC) ;- (UDPHS) UDPHS Test Mode Register
AT91C_UDPHS_TST           EQU (0x400A40E0) ;- (UDPHS) UDPHS Test Register
AT91C_UDPHS_TSTSOFCNT     EQU (0x400A40D0) ;- (UDPHS) UDPHS Test SOF Counter Register
AT91C_UDPHS_FNUM          EQU (0x400A4004) ;- (UDPHS) UDPHS Frame Number Register
AT91C_UDPHS_TSTCNTA       EQU (0x400A40D4) ;- (UDPHS) UDPHS Test A Counter Register
AT91C_UDPHS_INTSTA        EQU (0x400A4014) ;- (UDPHS) UDPHS Interrupt Status Register
AT91C_UDPHS_IPFEATURES    EQU (0x400A40F8) ;- (UDPHS) UDPHS Features Register
AT91C_UDPHS_CLRINT        EQU (0x400A4018) ;- (UDPHS) UDPHS Clear Interrupt Register
AT91C_UDPHS_RIPNAME1      EQU (0x400A40F0) ;- (UDPHS) UDPHS Name1 Register
AT91C_UDPHS_CTRL          EQU (0x400A4000) ;- (UDPHS) UDPHS Control Register
AT91C_UDPHS_IPVERSION     EQU (0x400A40FC) ;- (UDPHS) UDPHS Version Register
// - ========== Register definition for HDMA_CH_0 peripheral ========== 
AT91C_HDMA_CH_0_SADDR     EQU (0x400B003C) ;- (HDMA_CH_0) HDMA Channel Source Address Register
AT91C_HDMA_CH_0_DADDR     EQU (0x400B0040) ;- (HDMA_CH_0) HDMA Channel Destination Address Register
AT91C_HDMA_CH_0_CFG       EQU (0x400B0050) ;- (HDMA_CH_0) HDMA Channel Configuration Register
AT91C_HDMA_CH_0_CTRLB     EQU (0x400B004C) ;- (HDMA_CH_0) HDMA Channel Control B Register
AT91C_HDMA_CH_0_CTRLA     EQU (0x400B0048) ;- (HDMA_CH_0) HDMA Channel Control A Register
AT91C_HDMA_CH_0_DSCR      EQU (0x400B0044) ;- (HDMA_CH_0) HDMA Channel Descriptor Address Register
// - ========== Register definition for HDMA_CH_1 peripheral ========== 
AT91C_HDMA_CH_1_DSCR      EQU (0x400B006C) ;- (HDMA_CH_1) HDMA Channel Descriptor Address Register
AT91C_HDMA_CH_1_CTRLB     EQU (0x400B0074) ;- (HDMA_CH_1) HDMA Channel Control B Register
AT91C_HDMA_CH_1_SADDR     EQU (0x400B0064) ;- (HDMA_CH_1) HDMA Channel Source Address Register
AT91C_HDMA_CH_1_CFG       EQU (0x400B0078) ;- (HDMA_CH_1) HDMA Channel Configuration Register
AT91C_HDMA_CH_1_DADDR     EQU (0x400B0068) ;- (HDMA_CH_1) HDMA Channel Destination Address Register
AT91C_HDMA_CH_1_CTRLA     EQU (0x400B0070) ;- (HDMA_CH_1) HDMA Channel Control A Register
// - ========== Register definition for HDMA_CH_2 peripheral ========== 
AT91C_HDMA_CH_2_CTRLA     EQU (0x400B0098) ;- (HDMA_CH_2) HDMA Channel Control A Register
AT91C_HDMA_CH_2_SADDR     EQU (0x400B008C) ;- (HDMA_CH_2) HDMA Channel Source Address Register
AT91C_HDMA_CH_2_CTRLB     EQU (0x400B009C) ;- (HDMA_CH_2) HDMA Channel Control B Register
AT91C_HDMA_CH_2_DADDR     EQU (0x400B0090) ;- (HDMA_CH_2) HDMA Channel Destination Address Register
AT91C_HDMA_CH_2_CFG       EQU (0x400B00A0) ;- (HDMA_CH_2) HDMA Channel Configuration Register
AT91C_HDMA_CH_2_DSCR      EQU (0x400B0094) ;- (HDMA_CH_2) HDMA Channel Descriptor Address Register
// - ========== Register definition for HDMA_CH_3 peripheral ========== 
AT91C_HDMA_CH_3_DSCR      EQU (0x400B00BC) ;- (HDMA_CH_3) HDMA Channel Descriptor Address Register
AT91C_HDMA_CH_3_SADDR     EQU (0x400B00B4) ;- (HDMA_CH_3) HDMA Channel Source Address Register
AT91C_HDMA_CH_3_CTRLB     EQU (0x400B00C4) ;- (HDMA_CH_3) HDMA Channel Control B Register
AT91C_HDMA_CH_3_CFG       EQU (0x400B00C8) ;- (HDMA_CH_3) HDMA Channel Configuration Register
AT91C_HDMA_CH_3_DADDR     EQU (0x400B00B8) ;- (HDMA_CH_3) HDMA Channel Destination Address Register
AT91C_HDMA_CH_3_CTRLA     EQU (0x400B00C0) ;- (HDMA_CH_3) HDMA Channel Control A Register
// - ========== Register definition for HDMA peripheral ========== 
AT91C_HDMA_VER            EQU (0x400B01FC) ;- (HDMA) HDMA VERSION REGISTER 
AT91C_HDMA_CHSR           EQU (0x400B0030) ;- (HDMA) HDMA Channel Handler Status Register
AT91C_HDMA_IPNAME2        EQU (0x400B01F4) ;- (HDMA) HDMA IPNAME2 REGISTER 
AT91C_HDMA_EBCIMR         EQU (0x400B0020) ;- (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Mask Register
AT91C_HDMA_CHDR           EQU (0x400B002C) ;- (HDMA) HDMA Channel Handler Disable Register
AT91C_HDMA_EN             EQU (0x400B0004) ;- (HDMA) HDMA Controller Enable Register
AT91C_HDMA_GCFG           EQU (0x400B0000) ;- (HDMA) HDMA Global Configuration Register
AT91C_HDMA_IPNAME1        EQU (0x400B01F0) ;- (HDMA) HDMA IPNAME1 REGISTER 
AT91C_HDMA_LAST           EQU (0x400B0010) ;- (HDMA) HDMA Software Last Transfer Flag Register
AT91C_HDMA_FEATURES       EQU (0x400B01F8) ;- (HDMA) HDMA FEATURES REGISTER 
AT91C_HDMA_CREQ           EQU (0x400B000C) ;- (HDMA) HDMA Software Chunk Transfer Request Register
AT91C_HDMA_EBCIER         EQU (0x400B0018) ;- (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Interrupt Enable register
AT91C_HDMA_CHER           EQU (0x400B0028) ;- (HDMA) HDMA Channel Handler Enable Register
AT91C_HDMA_ADDRSIZE       EQU (0x400B01EC) ;- (HDMA) HDMA ADDRSIZE REGISTER 
AT91C_HDMA_EBCISR         EQU (0x400B0024) ;- (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Status Register
AT91C_HDMA_SREQ           EQU (0x400B0008) ;- (HDMA) HDMA Software Single Request Register
AT91C_HDMA_EBCIDR         EQU (0x400B001C) ;- (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Interrupt Disable register

