una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3u2.h
// - *****************************************************************************
// -               PIO DEFINITIONS FOR AT91SAM3U2
// - *****************************************************************************
AT91C_PIO_PA0             EQU (1 <<  0) ;- Pin Controlled by PA0
AT91C_PA0_TIOB0           EQU (AT91C_PIO_PA0) ;-  
AT91C_PA0_SPI0_NPCS1      EQU (AT91C_PIO_PA0) ;-  
AT91C_PIO_PA1             EQU (1 <<  1) ;- Pin Controlled by PA1
AT91C_PA1_TIOA0           EQU (AT91C_PIO_PA1) ;-  
AT91C_PA1_SPI0_NPCS2      EQU (AT91C_PIO_PA1) ;-  
AT91C_PIO_PA10            EQU (1 << 10) ;- Pin Controlled by PA10
AT91C_PA10_TWCK0          EQU (AT91C_PIO_PA10) ;-  
AT91C_PA10_PWML3          EQU (AT91C_PIO_PA10) ;-  
AT91C_PIO_PA11            EQU (1 << 11) ;- Pin Controlled by PA11
AT91C_PA11_DRXD           EQU (AT91C_PIO_PA11) ;-  
AT91C_PIO_PA12            EQU (1 << 12) ;- Pin Controlled by PA12
AT91C_PA12_DTXD           EQU (AT91C_PIO_PA12) ;-  
AT91C_PIO_PA13            EQU (1 << 13) ;- Pin Controlled by PA13
AT91C_PA13_SPI0_MISO      EQU (AT91C_PIO_PA13) ;-  
AT91C_PIO_PA14            EQU (1 << 14) ;- Pin Controlled by PA14
AT91C_PA14_SPI0_MOSI      EQU (AT91C_PIO_PA14) ;-  
AT91C_PIO_PA15            EQU (1 << 15) ;- Pin Controlled by PA15
AT91C_PA15_SPI0_SPCK      EQU (AT91C_PIO_PA15) ;-  
AT91C_PA15_PWMH2          EQU (AT91C_PIO_PA15) ;-  
AT91C_PIO_PA16            EQU (1 << 16) ;- Pin Controlled by PA16
AT91C_PA16_SPI0_NPCS0     EQU (AT91C_PIO_PA16) ;-  
AT91C_PA16_NCS1           EQU (AT91C_PIO_PA16) ;-  
AT91C_PIO_PA17            EQU (1 << 17) ;- Pin Controlled by PA17
AT91C_PA17_SCK0           EQU (AT91C_PIO_PA17) ;-  
AT91C_PIO_PA18            EQU (1 << 18) ;- Pin Controlled by PA18
AT91C_PA18_TXD0           EQU (AT91C_PIO_PA18) ;-  
AT91C_PIO_PA19            EQU (1 << 19) ;- Pin Controlled by PA19
AT91C_PA19_RXD0           EQU (AT91C_PIO_PA19) ;-  
AT91C_PA19_SPI0_NPCS3     EQU (AT91C_PIO_PA19) ;-  
AT91C_PIO_PA2             EQU (1 <<  2) ;- Pin Controlled by PA2
AT91C_PA2_TCLK0           EQU (AT91C_PIO_PA2) ;-  
AT91C_PA2_ADTRG1          EQU (AT91C_PIO_PA2) ;-  
AT91C_PIO_PA20            EQU (1 << 20) ;- Pin Controlled by PA20
AT91C_PA20_TXD1           EQU (AT91C_PIO_PA20) ;-  
AT91C_PA20_PWMH3          EQU (AT91C_PIO_PA20) ;-  
AT91C_PIO_PA21            EQU (1 << 21) ;- Pin Controlled by PA21
AT91C_PA21_RXD1           EQU (AT91C_PIO_PA21) ;-  
AT91C_PA21_PCK0           EQU (AT91C_PIO_PA21) ;-  
AT91C_PIO_PA22            EQU (1 << 22) ;- Pin Controlled by PA22
AT91C_PA22_TXD2           EQU (AT91C_PIO_PA22) ;-  
AT91C_PA22_RTS1           EQU (AT91C_PIO_PA22) ;-  
AT91C_PIO_PA23            EQU (1 << 23) ;- Pin Controlled by PA23
AT91C_PA23_RXD2           EQU (AT91C_PIO_PA23) ;-  
AT91C_PA23_CTS1           EQU (AT91C_PIO_PA23) ;-  
AT91C_PIO_PA24            EQU (1 << 24) ;- Pin Controlled by PA24
AT91C_PA24_TWD1           EQU (AT91C_PIO_PA24) ;-  
AT91C_PA24_SCK1           EQU (AT91C_PIO_PA24) ;-  
AT91C_PIO_PA25            EQU (1 << 25) ;- Pin Controlled by PA25
AT91C_PA25_TWCK1          EQU (AT91C_PIO_PA25) ;-  
AT91C_PA25_SCK2           EQU (AT91C_PIO_PA25) ;-  
AT91C_PIO_PA26            EQU (1 << 26) ;- Pin Controlled by PA26
AT91C_PA26_TD0            EQU (AT91C_PIO_PA26) ;-  
AT91C_PA26_TCLK2          EQU (AT91C_PIO_PA26) ;-  
AT91C_PIO_PA27            EQU (1 << 27) ;- Pin Controlled by PA27
AT91C_PA27_RD0            EQU (AT91C_PIO_PA27) ;-  
AT91C_PA27_PCK0           EQU (AT91C_PIO_PA27) ;-  
AT91C_PIO_PA28            EQU (1 << 28) ;- Pin Controlled by PA28
AT91C_PA28_TK0            EQU (AT91C_PIO_PA28) ;-  
AT91C_PA28_PWMH0          EQU (AT91C_PIO_PA28) ;-  
AT91C_PIO_PA29            EQU (1 << 29) ;- Pin Controlled by PA29
AT91C_PA29_RK0            EQU (AT91C_PIO_PA29) ;-  
AT91C_PA29_PWMH1          EQU (AT91C_PIO_PA29) ;-  
AT91C_PIO_PA3             EQU (1 <<  3) ;- Pin Controlled by PA3
AT91C_PA3_MCI0_CK         EQU (AT91C_PIO_PA3) ;-  
AT91C_PA3_PCK1            EQU (AT91C_PIO_PA3) ;-  
AT91C_PIO_PA30            EQU (1 << 30) ;- Pin Controlled by PA30
AT91C_PA30_TF0            EQU (AT91C_PIO_PA30) ;-  
AT91C_PA30_TIOA2          EQU (AT91C_PIO_PA30) ;-  
AT91C_PIO_PA31            EQU (1 << 31) ;- Pin Controlled by PA31
AT91C_PA31_RF0            EQU (AT91C_PIO_PA31) ;-  
AT91C_PA31_TIOB2          EQU (AT91C_PIO_PA31) ;-  
AT91C_PIO_PA4             EQU (1 <<  4) ;- Pin Controlled by PA4
AT91C_PA4_MCI0_CDA        EQU (AT91C_PIO_PA4) ;-  
AT91C_PA4_PWMH0           EQU (AT91C_PIO_PA4) ;-  
AT91C_PIO_PA5             EQU (1 <<  5) ;- Pin Controlled by PA5
AT91C_PA5_MCI0_DA0        EQU (AT91C_PIO_PA5) ;-  
AT91C_PA5_PWMH1           EQU (AT91C_PIO_PA5) ;-  
AT91C_PIO_PA6             EQU (1 <<  6) ;- Pin Controlled by PA6
AT91C_PA6_MCI0_DA1        EQU (AT91C_PIO_PA6) ;-  
AT91C_PA6_PWMH2           EQU (AT91C_PIO_PA6) ;-  
AT91C_PIO_PA7             EQU (1 <<  7) ;- Pin Controlled by PA7
AT91C_PA7_MCI0_DA2        EQU (AT91C_PIO_PA7) ;-  
AT91C_PA7_PWML0           EQU (AT91C_PIO_PA7) ;-  
AT91C_PIO_PA8             EQU (1 <<  8) ;- Pin Controlled by PA8
AT91C_PA8_MCI0_DA3        EQU (AT91C_PIO_PA8) ;-  
AT91C_PA8_PWML1           EQU (AT91C_PIO_PA8) ;-  
AT91C_PIO_PA9             EQU (1 <<  9) ;- Pin Controlled by PA9
AT91C_PA9_TWD0            EQU (AT91C_PIO_PA9) ;-  
AT91C_PA9_PWML2           EQU (AT91C_PIO_PA9) ;-  
AT91C_PIO_PB0             EQU (1 <<  0) ;- Pin Controlled by PB0
AT91C_PB0_PWMH0           EQU (AT91C_PIO_PB0) ;-  
AT91C_PB0_A2              EQU (AT91C_PIO_PB0) ;-  
AT91C_PIO_PB1             EQU (1 <<  1) ;- Pin Controlled by PB1
AT91C_PB1_PWMH1           EQU (AT91C_PIO_PB1) ;-  
AT91C_PB1_A3              EQU (AT91C_PIO_PB1) ;-  
AT91C_PIO_PB10            EQU (1 << 10) ;- Pin Controlled by PB10
AT91C_PB10_D1             EQU (AT91C_PIO_PB10) ;-  
AT91C_PB10_DSR0           EQU (AT91C_PIO_PB10) ;-  
AT91C_PIO_PB11            EQU (1 << 11) ;- Pin Controlled by PB11
AT91C_PB11_D2             EQU (AT91C_PIO_PB11) ;-  
AT91C_PB11_DCD0           EQU (AT91C_PIO_PB11) ;-  
AT91C_PIO_PB12            EQU (1 << 12) ;- Pin Controlled by PB12
AT91C_PB12_D3             EQU (AT91C_PIO_PB12) ;-  
AT91C_PB12_RI0            EQU (AT91C_PIO_PB12) ;-  
AT91C_PIO_PB13            EQU (1 << 13) ;- Pin Controlled by PB13
AT91C_PB13_D4             EQU (AT91C_PIO_PB13) ;-  
AT91C_PB13_PWMH0          EQU (AT91C_PIO_PB13) ;-  
AT91C_PIO_PB14            EQU (1 << 14) ;- Pin Controlled by PB14
AT91C_PB14_D5             EQU (AT91C_PIO_PB14) ;-  
AT91C_PB14_PWMH1          EQU (AT91C_PIO_PB14) ;-  
AT91C_PIO_PB15            EQU (1 << 15) ;- Pin Controlled by PB15
AT91C_PB15_D6             EQU (AT91C_PIO_PB15) ;-  
AT91C_PB15_PWMH2          EQU (AT91C_PIO_PB15) ;-  
AT91C_PIO_PB16            EQU (1 << 16) ;- Pin Controlled by PB16
AT91C_PB16_D7             EQU (AT91C_PIO_PB16) ;-  
AT91C_PB16_PWMH3          EQU (AT91C_PIO_PB16) ;-  
AT91C_PIO_PB17            EQU (1 << 17) ;- Pin Controlled by PB17
AT91C_PB17_NANDOE         EQU (AT91C_PIO_PB17) ;-  
AT91C_PB17_PWML0          EQU (AT91C_PIO_PB17) ;-  
AT91C_PIO_PB18            EQU (1 << 18) ;- Pin Controlled by PB18
AT91C_PB18_NANDWE         EQU (AT91C_PIO_PB18) ;-  
AT91C_PB18_PWML1          EQU (AT91C_PIO_PB18) ;-  
AT91C_PIO_PB19            EQU (1 << 19) ;- Pin Controlled by PB19
AT91C_PB19_NRD            EQU (AT91C_PIO_PB19) ;-  
AT91C_PB19_PWML2          EQU (AT91C_PIO_PB19) ;-  
AT91C_PIO_PB2             EQU (1 <<  2) ;- Pin Controlled by PB2
AT91C_PB2_PWMH2           EQU (AT91C_PIO_PB2) ;-  
AT91C_PB2_A4              EQU (AT91C_PIO_PB2) ;-  
AT91C_PIO_PB20            EQU (1 << 20) ;- Pin Controlled by PB20
AT91C_PB20_NCS0           EQU (AT91C_PIO_PB20) ;-  
AT91C_PB20_PWML3          EQU (AT91C_PIO_PB20) ;-  
AT91C_PIO_PB21            EQU (1 << 21) ;- Pin Controlled by PB21
AT91C_PB21_A21_NANDALE    EQU (AT91C_PIO_PB21) ;-  
AT91C_PB21_RTS2           EQU (AT91C_PIO_PB21) ;-  
AT91C_PIO_PB22            EQU (1 << 22) ;- Pin Controlled by PB22
AT91C_PB22_A22_NANDCLE    EQU (AT91C_PIO_PB22) ;-  
AT91C_PB22_CTS2           EQU (AT91C_PIO_PB22) ;-  
AT91C_PIO_PB23            EQU (1 << 23) ;- Pin Controlled by PB23
AT91C_PB23_NWR0_NWE       EQU (AT91C_PIO_PB23) ;-  
AT91C_PB23_PCK2           EQU (AT91C_PIO_PB23) ;-  
AT91C_PIO_PB24            EQU (1 << 24) ;- Pin Controlled by PB24
AT91C_PB24_NANDRDY        EQU (AT91C_PIO_PB24) ;-  
AT91C_PB24_PCK1           EQU (AT91C_PIO_PB24) ;-  
AT91C_PIO_PB25            EQU (1 << 25) ;- Pin Controlled by PB25
AT91C_PB25_D8             EQU (AT91C_PIO_PB25) ;-  
AT91C_PB25_PWML0          EQU (AT91C_PIO_PB25) ;-  
AT91C_PIO_PB26            EQU (1 << 26) ;- Pin Controlled by PB26
AT91C_PB26_D9             EQU (AT91C_PIO_PB26) ;-  
AT91C_PB26_PWML1          EQU (AT91C_PIO_PB26) ;-  
AT91C_PIO_PB27            EQU (1 << 27) ;- Pin Controlled by PB27
AT91C_PB27_D10            EQU (AT91C_PIO_PB27) ;-  
AT91C_PB27_PWML2          EQU (AT91C_PIO_PB27) ;-  
AT91C_PIO_PB28            EQU (1 << 28) ;- Pin Controlled by PB28
AT91C_PB28_D11            EQU (AT91C_PIO_PB28) ;-  
AT91C_PB28_PWML3          EQU (AT91C_PIO_PB28) ;-  
AT91C_PIO_PB29            EQU (1 << 29) ;- Pin Controlled by PB29
AT91C_PB29_D12            EQU (AT91C_PIO_PB29) ;-  
AT91C_PIO_PB3             EQU (1 <<  3) ;- Pin Controlled by PB3
AT91C_PB3_PWMH3           EQU (AT91C_PIO_PB3) ;-  
AT91C_PB3_A5              EQU (AT91C_PIO_PB3) ;-  
AT91C_PIO_PB30            EQU (1 << 30) ;- Pin Controlled by PB30
AT91C_PB30_D13            EQU (AT91C_PIO_PB30) ;-  
AT91C_PIO_PB31            EQU (1 << 31) ;- Pin Controlled by PB31
AT91C_PB31_D14            EQU (AT91C_PIO_PB31) ;-  
AT91C_PIO_PB4             EQU (1 <<  4) ;- Pin Controlled by PB4
AT91C_PB4_TCLK1           EQU (AT91C_PIO_PB4) ;-  
AT91C_PB4_A6              EQU (AT91C_PIO_PB4) ;-  
AT91C_PIO_PB5             EQU (1 <<  5) ;- Pin Controlled by PB5
AT91C_PB5_TIOA1           EQU (AT91C_PIO_PB5) ;-  
AT91C_PB5_A7              EQU (AT91C_PIO_PB5) ;-  
AT91C_PIO_PB6             EQU (1 <<  6) ;- Pin Controlled by PB6
AT91C_PB6_TIOB1           EQU (AT91C_PIO_PB6) ;-  
AT91C_PB6_D15             EQU (AT91C_PIO_PB6) ;-  
AT91C_PIO_PB7             EQU (1 <<  7) ;- Pin Controlled by PB7
AT91C_PB7_RTS0            EQU (AT91C_PIO_PB7) ;-  
AT91C_PB7_A0_NBS0         EQU (AT91C_PIO_PB7) ;-  
AT91C_PIO_PB8             EQU (1 <<  8) ;- Pin Controlled by PB8
AT91C_PB8_CTS0            EQU (AT91C_PIO_PB8) ;-  
AT91C_PB8_A1              EQU (AT91C_PIO_PB8) ;-  
AT91C_PIO_PB9             EQU (1 <<  9) ;- Pin Controlled by PB9
AT91C_PB9_D0              EQU (AT91C_PIO_PB9) ;-  
AT91C_PB9_DTR0            EQU (AT91C_PIO_PB9) ;-  
AT91C_PIO_PC0             EQU (1 <<  0) ;- Pin Controlled by PC0
AT91C_PC0_A2              EQU (AT91C_PIO_PC0) ;-  
AT91C_PIO_PC1             EQU (1 <<  1) ;- Pin Controlled by PC1
AT91C_PC1_A3              EQU (AT91C_PIO_PC1) ;-  
AT91C_PIO_PC10            EQU (1 << 10) ;- Pin Controlled by PC10
AT91C_PC10_A12            EQU (AT91C_PIO_PC10) ;-  
AT91C_PC10_CTS3           EQU (AT91C_PIO_PC10) ;-  
AT91C_PIO_PC11            EQU (1 << 11) ;- Pin Controlled by PC11
AT91C_PC11_A13            EQU (AT91C_PIO_PC11) ;-  
AT91C_PC11_RTS3           EQU (AT91C_PIO_PC11) ;-  
AT91C_PIO_PC12            EQU (1 << 12) ;- Pin Controlled by PC12
AT91C_PC12_NCS1           EQU (AT91C_PIO_PC12) ;-  
AT91C_PC12_TXD3           EQU (AT91C_PIO_PC12) ;-  
AT91C_PIO_PC13            EQU (1 << 13) ;- Pin Controlled by PC13
AT91C_PC13_A2             EQU (AT91C_PIO_PC13) ;-  
AT91C_PC13_RXD3           EQU (AT91C_PIO_PC13) ;-  
AT91C_PIO_PC14            EQU (1 << 14) ;- Pin Controlled by PC14
AT91C_PC14_A3             EQU (AT91C_PIO_PC14) ;-  
AT91C_PC14_SPI0_NPCS2     EQU (AT91C_PIO_PC14) ;-  
AT91C_PIO_PC15            EQU (1 << 15) ;- Pin Controlled by PC15
AT91C_PC15_NWR1_NBS1      EQU (AT91C_PIO_PC15) ;-  
AT91C_PIO_PC16            EQU (1 << 16) ;- Pin Controlled by PC16
AT91C_PC16_NCS2           EQU (AT91C_PIO_PC16) ;-  
AT91C_PC16_PWML3          EQU (AT91C_PIO_PC16) ;-  
AT91C_PIO_PC17            EQU (1 << 17) ;- Pin Controlled by PC17
AT91C_PC17_NCS3           EQU (AT91C_PIO_PC17) ;-  
AT91C_PC17_A24            EQU (AT91C_PIO_PC17) ;-  
AT91C_PIO_PC18            EQU (1 << 18) ;- Pin Controlled by PC18
AT91C_PC18_NWAIT          EQU (AT91C_PIO_PC18) ;-  
AT91C_PIO_PC19            EQU (1 << 19) ;- Pin Controlled by PC19
AT91C_PC19_SCK3           EQU (AT91C_PIO_PC19) ;-  
AT91C_PC19_NPCS1          EQU (AT91C_PIO_PC19) ;-  
AT91C_PIO_PC2             EQU (1 <<  2) ;- Pin Controlled by PC2
AT91C_PC2_A4              EQU (AT91C_PIO_PC2) ;-  
AT91C_PIO_PC20            EQU (1 << 20) ;- Pin Controlled by PC20
AT91C_PC20_A14            EQU (AT91C_PIO_PC20) ;-  
AT91C_PIO_PC21            EQU (1 << 21) ;- Pin Controlled by PC21
AT91C_PC21_A15            EQU (AT91C_PIO_PC21) ;-  
AT91C_PIO_PC22            EQU (1 << 22) ;- Pin Controlled by PC22
AT91C_PC22_A16            EQU (AT91C_PIO_PC22) ;-  
AT91C_PIO_PC23            EQU (1 << 23) ;- Pin Controlled by PC23
AT91C_PC23_A17            EQU (AT91C_PIO_PC23) ;-  
AT91C_PIO_PC24            EQU (1 << 24) ;- Pin Controlled by PC24
AT91C_PC24_A18            EQU (AT91C_PIO_PC24) ;-  
AT91C_PC24_PWMH0          EQU (AT91C_PIO_PC24) ;-  
AT91C_PIO_PC25            EQU (1 << 25) ;- Pin Controlled by PC25
AT91C_PC25_A19            EQU (AT91C_PIO_PC25) ;-  
AT91C_PC25_PWMH1          EQU (AT91C_PIO_PC25) ;-  
AT91C_PIO_PC26            EQU (1 << 26) ;- Pin Controlled by PC26
AT91C_PC26_A20            EQU (AT91C_PIO_PC26) ;-  
AT91C_PC26_PWMH2          EQU (AT91C_PIO_PC26) ;-  
AT91C_PIO_PC27            EQU (1 << 27) ;- Pin Controlled by PC27
AT91C_PC27_A23            EQU (AT91C_PIO_PC27) ;-  
AT91C_PC27_PWMH3          EQU (AT91C_PIO_PC27) ;-  
AT91C_PIO_PC28            EQU (1 << 28) ;- Pin Controlled by PC28
AT91C_PC28_A24            EQU (AT91C_PIO_PC28) ;-  
AT91C_PC28_MCI0_DA4       EQU (AT91C_PIO_PC28) ;-  
AT91C_PIO_PC29            EQU (1 << 29) ;- Pin Controlled by PC29
AT91C_PC29_PWML0          EQU (AT91C_PIO_PC29) ;-  
AT91C_PC29_MCI0_DA5       EQU (AT91C_PIO_PC29) ;-  
AT91C_PIO_PC3             EQU (1 <<  3) ;- Pin Controlled by PC3
AT91C_PC3_A5              EQU (AT91C_PIO_PC3) ;-  
AT91C_PC3_SPI0_NPCS1      EQU (AT91C_PIO_PC3) ;-  
AT91C_PIO_PC30            EQU (1 << 30) ;- Pin Controlled by PC30
AT91C_PC30_PWML1          EQU (AT91C_PIO_PC30) ;-  
AT91C_PC30_MCI0_DA6       EQU (AT91C_PIO_PC30) ;-  
AT91C_PIO_PC31            EQU (1 << 31) ;- Pin Controlled by PC31
AT91C_PC31_PWML2          EQU (AT91C_PIO_PC31) ;-  
AT91C_PC31_MCI0_DA7       EQU (AT91C_PIO_PC31) ;-  
AT91C_PIO_PC4             EQU (1 <<  4) ;- Pin Controlled by PC4
AT91C_PC4_A6              EQU (AT91C_PIO_PC4) ;-  
AT91C_PC4_SPI0_NPCS2      EQU (AT91C_PIO_PC4) ;-  
AT91C_PIO_PC5             EQU (1 <<  5) ;- Pin Controlled by PC5
AT91C_PC5_A7              EQU (AT91C_PIO_PC5) ;-  
AT91C_PC5_SPI0_NPCS3      EQU (AT91C_PIO_PC5) ;-  
AT91C_PIO_PC6             EQU (1 <<  6) ;- Pin Controlled by PC6
AT91C_PC6_A8              EQU (AT91C_PIO_PC6) ;-  
AT91C_PC6_PWML0           EQU (AT91C_PIO_PC6) ;-  
AT91C_PIO_PC7             EQU (1 <<  7) ;- Pin Controlled by PC7
AT91C_PC7_A9              EQU (AT91C_PIO_PC7) ;-  
AT91C_PC7_PWML1           EQU (AT91C_PIO_PC7) ;-  
AT91C_PIO_PC8             EQU (1 <<  8) ;- Pin Controlled by PC8
AT91C_PC8_A10             EQU (AT91C_PIO_PC8) ;-  
AT91C_PC8_PWML2           EQU (AT91C_PIO_PC8) ;-  
AT91C_PIO_PC9             EQU (1 <<  9) ;- Pin Controlled by PC9
AT91C_PC9_A11             EQU (AT91C_PIO_PC9) ;-  
AT91C_PC9_PWML3           EQU (AT91C_PIO_PC9) ;-  

// - *****************************************************************************
// -               PERIPHERAL ID DEFINITIONS FOR AT91SAM3U2
// - *****************************************************************************
AT91C_ID_SUPC             EQU ( 0) ;- SUPPLY CONTROLLER
AT91C_ID_RSTC             EQU ( 1) ;- RESET CONTROLLER
AT91C_ID_RTC              EQU ( 2) ;- REAL TIME CLOCK
AT91C_ID_RTT              EQU ( 3) ;- REAL TIME TIMER
AT91C_ID_WDG              EQU ( 4) ;- WATCHDOG TIMER
AT91C_ID_PMC              EQU ( 5) ;- PMC
AT91C_ID_EFC0             EQU ( 6) ;- EFC0
AT91C_ID_EFC1             EQU ( 7) ;- EFC1
AT91C_ID_DBGU             EQU ( 8) ;- DBGU
AT91C_ID_HSMC4            EQU ( 9) ;- HSMC4
AT91C_ID_PIOA             EQU (10) ;- Parallel IO Controller A
AT91C_ID_PIOB             EQU (11) ;- Parallel IO Controller B
AT91C_ID_PIOC             EQU (12) ;- Parallel IO Controller C
AT91C_ID_US0              EQU (13) ;- USART 0
AT91C_ID_US1              EQU (14) ;- USART 1
AT91C_ID_US2              EQU (15) ;- USART 2
AT91C_ID_US3              EQU (16) ;- USART 3
AT91C_ID_MCI0             EQU (17) ;- Multimedia Card Interface
AT91C_ID_TWI0             EQU (18) ;- TWI 0
AT91C_ID_TWI1             EQU (19) ;- TWI 1
AT91C_ID_SPI0             EQU (20) ;- Serial Peripheral Interface
AT91C_ID_SSC0             EQU (21) ;- Serial Synchronous Controller 0
AT91C_ID_TC0              EQU (22) ;- Timer Counter 0
AT91C_ID_TC1              EQU (23) ;- Timer Counter 1
AT91C_ID_TC2              EQU (24) ;- Timer Counter 2
AT91C_ID_PWMC             EQU (25) ;- Pulse Width Modulation Controller
AT91C_ID_ADC              EQU (27) ;- ADC controller
AT91C_ID_HDMA             EQU (28) ;- HDMA
AT91C_ID_UDPHS            EQU (29) ;- USB Device High Speed
AT91C_ALL_INT             EQU (0x3BFFFFFF) ;- ALL VALID INTERRUPTS

// - *****************************************************************************
// -               BASE ADDRESS DEFINITIONS FOR AT91SAM3U2
// - *****************************************************************************
AT91C_BASE_SYS            EQU (0x400E0000) ;- (SYS) Base Address
AT91C_BASE_HSMC4_CS0      EQU (0x400E0070) ;- (HSMC4_CS0) Base Address
AT91C_BASE_HSMC4_CS1      EQU (0x400E0084) ;- (HSMC4_CS1) Base Address
AT91C_BASE_HSMC4_CS2      EQU (0x400E0098) ;- (HSMC4_CS2) Base Address
AT91C_BASE_HSMC4_CS3      EQU (0x400E00AC) ;- (HSMC4_CS3) Base Address
AT91C_BASE_HSMC4_NFC      EQU (0x400E00FC) ;- (HSMC4_NFC) Base Address
AT91C_BASE_HSMC4          EQU (0x400E0000) ;- (HSMC4) Base Address
AT91C_BASE_MATRIX         EQU (0x400E0200) ;- (MATRIX) Base Address
AT91C_BASE_NVIC           EQU (0xE000E000) ;- (NVIC) Base Address
AT91C_BASE_MPU            EQU (0xE000ED90) ;- (MPU) Base Address
AT91C_BASE_CM3            EQU (0xE000ED00) ;- (CM3) Base Address
AT91C_BASE_PDC_DBGU       EQU (0x400E0700) ;- (PDC_DBGU) Base Address
AT91C_BASE_DBGU           EQU (0x400E0600) ;- (DBGU) Base Address
AT91C_BASE_PIOA           EQU (0x400E0C00) ;- (PIOA) Base Address
AT91C_BASE_PIOB           EQU (0x400E0E00) ;- (PIOB) Base Address
AT91C_BASE_PIOC           EQU (0x400E1000) ;- (PIOC) Base Address
AT91C_BASE_PMC            EQU (0x400E0400) ;- (PMC) Base Address
AT91C_BASE_CKGR           EQU (0x400E041C) ;- (CKGR) Base Address
AT91C_BASE_RSTC           EQU (0x400E1200) ;- (RSTC) Base Address
AT91C_BASE_SUPC           EQU (0x400E1210) ;- (SUPC) Base Address
AT91C_BASE_RTTC           EQU (0x400E1230) ;- (RTTC) Base Address
AT91C_BASE_WDTC           EQU (0x400E1250) ;- (WDTC) Base Address
AT91C_BASE_RTC            EQU (0x400E1260) ;- (RTC) Base Address
AT91C_BASE_ADC0           EQU (0x400AC000) ;- (ADC0) Base Address
AT91C_BASE_TC0            EQU (0x40080000) ;- (TC0) Base Address
AT91C_BASE_TC1            EQU (0x40080040) ;- (TC1) Base Address
AT91C_BASE_TC2            EQU (0x40080080) ;- (TC2) Base Address
AT91C_BASE_TCB0           EQU (0x40080000) ;- (TCB0) Base Address
AT91C_BASE_TCB1           EQU (0x40080040) ;- (TCB1) Base Address
AT91C_BASE_TCB2           EQU (0x40080080) ;- (TCB2) Base Address
AT91C_BASE_EFC0           EQU (0x400E0800) ;- (EFC0) Base Address
AT91C_BASE_EFC1           EQU (0x400E0A00) ;- (EFC1) Base Address
AT91C_BASE_MCI0           EQU (0x40000000) ;- (MCI0) Base Address
AT91C_BASE_PDC_TWI0       EQU (0x40084100) ;- (PDC_TWI0) Base Address
AT91C_BASE_PDC_TWI1       EQU (0x40088100) ;- (PDC_TWI1) Base Address
AT91C_BASE_TWI0           EQU (0x40084000) ;- (TWI0) Base Address
AT91C_BASE_TWI1           EQU (0x40088000) ;- (TWI1) Base Address
AT91C_BASE_PDC_US0        EQU (0x40090100) ;- (PDC_US0) Base Address
AT91C_BASE_US0            EQU (0x40090000) ;- (US0) Base Address
AT91C_BASE_PDC_US1        EQU (0x40094100) ;- (PDC_US1) Base Address
AT91C_BASE_US1            EQU (0x40094000) ;- (US1) Base Address
AT91C_BASE_PDC_US2        EQU (0x40098100) ;- (PDC_US2) Base Address
AT91C_BASE_US2            EQU (0x40098000) ;- (US2) Base Address
AT91C_BASE_PDC_US3        EQU (0x4009C100) ;- (PDC_US3) Base Address
AT91C_BASE_US3            EQU (0x4009C000) ;- (US3) Base Address
AT91C_BASE_PDC_SSC0       EQU (0x40004100) ;- (PDC_SSC0) Base Address
AT91C_BASE_SSC0           EQU (0x40004000) ;- (SSC0) Base Address
AT91C_BASE_PDC_PWMC       EQU (0x4008C100) ;- (PDC_PWMC) Base Address
AT91C_BASE_PWMC_CH0       EQU (0x4008C200) ;- (PWMC_CH0) Base Address
AT91C_BASE_PWMC_CH1       EQU (0x4008C220) ;- (PWMC_CH1) Base Address
AT91C_BASE_PWMC_CH2       EQU (0x4008C240) ;- (PWMC_CH2) Base Address
AT91C_BASE_PWMC_CH3       EQU (0x4008C260) ;- (PWMC_CH3) Base Address
AT91C_BASE_PWMC           EQU (0x4008C000) ;- (PWMC) Base Address
AT91C_BASE_SPI0           EQU (0x40008000) ;- (SPI0) Base Address
AT91C_BASE_UDPHS_EPTFIFO  EQU (0x20180000) ;- (UDPHS_EPTFIFO) Base Address
AT91C_BASE_UDPHS_EPT_0    EQU (0x400A4100) ;- (UDPHS_EPT_0) Base Address
AT91C_BASE_UDPHS_EPT_1    EQU (0x400A4120) ;- (UDPHS_EPT_1) Base Address
AT91C_BASE_UDPHS_EPT_2    EQU (0x400A4140) ;- (UDPHS_EPT_2) Base Address
AT91C_BASE_UDPHS_EPT_3    EQU (0x400A4160) ;- (UDPHS_EPT_3) Base Address
AT91C_BASE_UDPHS_EPT_4    EQU (0x400A4180) ;- (UDPHS_EPT_4) Base Address
AT91C_BASE_UDPHS_EPT_5    EQU (0x400A41A0) ;- (UDPHS_EPT_5) Base Address
AT91C_BASE_UDPHS_EPT_6    EQU (0x400A41C0) ;- (UDPHS_EPT_6) Base Address
AT91C_BASE_UDPHS_DMA_1    EQU (0x400A4310) ;- (UDPHS_DMA_1) Base Address
AT91C_BASE_UDPHS_DMA_2    EQU (0x400A4320) ;- (UDPHS_DMA_2) Base Address
AT91C_BASE_UDPHS_DMA_3    EQU (0x400A4330) ;- (UDPHS_DMA_3) Base Address
AT91C_BASE_UDPHS_DMA_4    EQU (0x400A4340) ;- (UDPHS_DMA_4) Base Address
AT91C_BASE_UDPHS_DMA_5    EQU (0x400A4350) ;- (UDPHS_DMA_5) Base Address
AT91C_BASE_UDPHS_DMA_6    EQU (0x400A4360) ;- (UDPHS_DMA_6) Base Address
AT91C_BASE_UDPHS          EQU (0x400A4000) ;- (UDPHS) Base Address
AT91C_BASE_HDMA_CH_0      EQU (0x400B003C) ;- (HDMA_CH_0) Base Address
AT91C_BASE_HDMA_CH_1      EQU (0x400B0064) ;- (HDMA_CH_1) Base Address
AT91C_BASE_HDMA_CH_2      EQU (0x400B008C) ;- (HDMA_CH_2) Base Address
AT91C_BASE_HDMA_CH_3      EQU (0x400B00B4) ;- (HDMA_CH_3) Base Address
AT91C_BASE_HDMA           EQU (0x400B0000) ;- (HDMA) Base Address

